{
    "arcane gate]": "{\n\tname : \"Arcane Gate\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"P\", 214],\n\tlevel : 6,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"500 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 10 min\",\n\tdescription : \"Two portals, up to 500 ft apart, teleport any to other side; portals are filled with opaque mist\",\n\tdescriptionFull : \"You create linked teleportation portals that remain open for the duration. Choose two points on the ground that you can see, one point within 10 feet of you and one point within 500 feet of you. A circular portal, 10 feet in diameter, opens over each point. If the portal would open in the space occupied by a creature, the spell fails, and the casting is lost.\" + \"\\n   \" + \"The portals are two-dimensional glowing rings filled with mist, hovering inches from the ground and perpendicular to it at the points you choose. A ring is visible only from one side (your choice), which is the side that functions as a portal.\" + \"\\n   \" + \"Any creature or object entering the portal exits from the other portal as if the two were adjacent to each other, passing through a portal from the non-portal side has no effect. The mist that fills each portal is opaque and blocks vision through it. On your turn, you can rotate the rings as a bonus action so that the active side faces in a different direction.\"\n}",
    "armor of agathys]": "{\n\tname : \"Armor of Agathys\",\n\tclasses : [\"warlock\"],\n\tsource : [\"P\", 215],\n\tlevel : 1,\n\tschool : \"Abjur\",\n\ttime : \"1 a\",\n\trange : \"Self\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A cup of water\",\n\tduration : \"1 h\",\n\tdescription : \"5+5/SL temp hp; as long as temp hp last any crea that hits in melee takes 5+5/SL Cold dmg\",\n\tdescriptionFull : \"A protective magical force surrounds you, manifesting as a spectral frost that covers you and your gear. You gain 5 temporary hit points for the duration. If a creature hits you with a melee attack while you have these hit points, the creature takes 5 cold damage.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 2nd level or higher, both the temporary hit points and the cold damage increase by 5 for each slot level above 1st.\"\n}",
    "arms of hadar]": "{\n\tname : \"Arms of Hadar\",\n\tclasses : [\"warlock\"],\n\tsource : [\"P\", 215],\n\tlevel : 1,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"10-ft rad\",\n\tcomponents : \"V,S\",\n\tduration : \"Instantaneous\",\n\tsave : \"Str\",\n\tdescription : \"2d6+1d6/SL Necrotic dmg; save halves; on failed save no reactions until next turn\",\n\tdescriptionFull : \"You invoke the power of Hadar, the Dark Hunger. Tendrils of dark energy erupt from you and batter all creatures within 10 feet of you. Each creature in that area must make a Strength saving throw. On a failed save, a target takes 2d6 necrotic damage and can't take reactions until its next turn. On a successful save, the creature takes half damage, but suffers no other effect.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.\"\n}",
    "aura of life]": "{\n\tname : \"Aura of Life\",\n\tclasses : [\"paladin\"],\n\tsource : [\"P\", 216],\n\tlevel : 4,\n\tschool : \"Abjur\",\n\ttime : \"1 a\",\n\trange : \"30-ft rad\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 10 min\",\n\tdescription : \"You + any crea while in area Necrotic dmg resist.; heals all living crea at 0 hp at start of turn to 1 hp\",\n\tdescriptionFull : \"Life-preserving energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. Each non-hostile creature in the aura (including you) has resistance to necrotic damage, and its hit point maximum can't be reduced. In addition, a non-hostile, living creature regains 1 hit point when it starts its turn in the aura with 0 hit points.\"\n}",
    "aura of purity]": "{\n\tname : \"Aura of Purity\",\n\tclasses : [\"paladin\"],\n\tsource : [\"P\", 216],\n\tlevel : 4,\n\tschool : \"Abjur\",\n\ttime : \"1 a\",\n\trange : \"30-ft rad\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 10 min\",\n\tdescription : \"You + any crea while in area Poison dmg resist., immune to disease, adv. on saves vs. conditions\",\n\tdescriptionFull : \"Purifying energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. Each non-hostile creature in the aura (including you) can't become diseased, has resistance to poison damage, and has advantage on saving throws against effects that cause any of the following conditions - blinded, charmed, deafened, frightened, paralyzed, poisoned, and stunned.\"\n}",
    "aura of vitality]": "{\n\tname : \"Aura of Vitality\",\n\tclasses : [\"paladin\"],\n\tsource : [\"P\", 216],\n\tlevel : 3,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"30-ft rad\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"You can heal 1 creature in range for 2d6 hp as a bonus action for the duration\",\n\tdescriptionFull : \"Healing energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. You can use a bonus action to cause one creature in the aura (including you) to regain 2d6 hit points.\"\n}",
    "banishing smite]": "{\n\tname : \"Banishing Smite\",\n\tclasses : [\"paladin\"],\n\tsource : [\"P\", 216],\n\tlevel : 5,\n\tschool : \"Abjur\",\n\ttime : \"1 bns\",\n\trange : \"Self\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"Next melee hit +5d10 Force dmg; if this brings target hp<50, you banish it until spell ends\",\n\tdescriptionFull : \"The next time you hit a creature with a weapon attack before this spell ends, your weapon crackles with force, and the attack deals an extra 5d10 force damage to the target. Additionally, if this attack reduces the target to 50 hit points of fewer, you banish it. If the target is native to a different plane of existence than the one you're on, the target disappears, returning to its home plane. If the target is native to the plane you're on, the creature vanishes into a harmless demiplane. While there, the target is incapacitated. It remains there until the spell ends, at which point the tart reappears in the space it left or in the nearest unoccupied space if that space is occupied.\"\n}",
    "beast sense]": "{\n\tname : \"Beast Sense\",\n\tclasses : [\"druid\", \"ranger\"],\n\tsource : [\"P\", 217],\n\tritual : true,\n\tlevel : 2,\n\tschool : \"Div\",\n\ttime : \"1 a\",\n\trange : \"Touch\",\n\tcomponents : \"S\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"Use 1 willing beast's senses; you are blinded and deafened while doing so\",\n\tdescriptionFull : \"You touch a willing beast. For the duration of the spell, you can use your action to see through the beast's eyes and hear what it hears, and continue to do so until you use your action to return to your normal senses.\"\n}",
    "blade ward]": "{\n\tname : \"Blade Ward\",\n\tclasses : [\"bard\", \"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"P\", 218],\n\tlevel : 0,\n\tschool : \"Abjur\",\n\ttime : \"1 a\",\n\trange : \"Self\",\n\tcomponents : \"V,S\",\n\tduration : \"1 rnd\",\n\tdescription : \"Until the end of your next turn, Bludgeoning, Piercing, and Slashing dmg resist. vs. weapons\",\n\tdescriptionFull : \"You extend your hand and trace a sigil of warding in the air. Until the end of your next turn, you have resistance against bludgeoning, piercing, and slashing damage dealt by weapon attacks.\"\n}",
    "blinding smite]": "{\n\tname : \"Blinding Smite\",\n\tclasses : [\"paladin\"],\n\tsource : [\"P\", 219],\n\tlevel : 3,\n\tschool : \"Evoc\",\n\ttime : \"1 bns\",\n\trange : \"Self\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Con\",\n\tdescription : \"Next melee hit +3d8 Radiant dmg; save or blinded; extra save at end of every turn\",\n\tdescriptionFull : \"The next time you hit a creature with a melee weapon attack during this spell's duration, you weapon flares with a bright light, and the attack deals an extra 3d8 radiant damage to the target. Additionally, the target must succeed on a Constitution saving throw or be blinded until the spell ends.\" + \"\\n   \" + \"A creature blinded by this spell makes another Constitution saving throw at the end of each of its turns. On a successful save, it is no longer blinded.\"\n}",
    "chromatic orb]": "{\n\tname : \"Chromatic Orb\",\n\tclasses : [\"sorcerer\", \"wizard\"],\n\tsource : [\"P\", 221],\n\tlevel : 1,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"90 ft\",\n\tcomponents : \"V,S,M\\u0192\",\n\tcompMaterial : \"A diamond worth at least 50 gp\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Spell attack for 3d8+1d8/SL Acid, Cold, Fire, Lightning, Poison or Thunder dmg (50gp)\",\n\tdescriptionFull : \"You hurl a 4-inch-diameter sphere of energy at a creature that you can see within range. You choose acid, cold, fire, lightning, poison, or thunder for the type of orb you create, and then make a ranged spell attack against the target. If the attack hits, the creature takes 3d8 damage of the type you chose.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.\"\n}",
    "circle of power]": "{\n\tname : \"Circle of Power\",\n\tclasses : [\"paladin\"],\n\tsource : [\"P\", 221],\n\tlevel : 5,\n\tschool : \"Abjur\",\n\ttime : \"1 a\",\n\trange : \"30-ft rad\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 10 min\",\n\tdescription : \"Any crea while in area adv. on saves vs. magical effects; if save would half dmg it takes no dmg\",\n\tdescriptionFull : \"Divine energy radiates from you, distorting and diffusing magical energy within 30 feet of you. Until the spell ends, the sphere moves with you, centered on you. For the duration, each friendly creature in the area (including you) has advantage on saving throws against spells and other magical effects. Additionally, when an affected creature succeeds on a saving throw made against a spell or magical effect that allows it to make a saving throw to take only half damage, it instead takes no damage if it succeeds on the saving throw.\"\n}",
    "cloud of daggers]": "{\n\tname : \"Cloud of Daggers\",\n\tclasses : [\"bard\", \"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"P\", 222],\n\tlevel : 2,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A sliver of glass\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"5-ft cube 4d4+2d4/SL Slashing dmg to all that enter or start turn in area\",\n\tdescriptionFull : \"You fill the air with spinning daggers in a cube 5 feet on each side, centered on a point you choose within range. A creature takes 4d4 slashing damage when it enters the spell's area for the first time on a turn or starts its turn there.\" + AtHigherLevels + \"when you cast this spell using a spell slot of 3rd level or higher, the damage increases by 2d4 for each slot level above 2nd.\"\n}",
    "compelled duel]": "{\n\tname : \"Compelled Duel\",\n\tclasses : [\"paladin\"],\n\tsource : [\"P\", 224],\n\tlevel : 1,\n\tschool : \"Ench\",\n\ttime : \"1 bns\",\n\trange : \"30 ft\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Wis\",\n\tdescription : \"1 crea save or dis. on attacks vs. not-you and save if moving more than 30 ft away\",\n\tdescriptionFull : \"You attempt to compel a creature into a duel. One creature that you can see within range must make a Wisdom saving throw. On a failed save, the creature is drawn to you, compelled by your divine demand. For the duration, it has disadvantage on attack rolls against creatures other than you, and must make a Wisdom saving throw each time it attempts to move to a space that is more than 30 feet away from you, if it succeeds on this saving throw, this spell doesn't restrict the target's movement for that turn.\" + \"\\n   \" + \"The spell ends if you attack any other creature, if you cast a spell that targets a hostile creature other than the target, if a creature friendly to you damages the target or casts a harmful spell on it, or if you end your turn more than 30 feet away from the target.\"\n}",
    "conjure barrage]": "{\n\tname : \"Conjure Barrage\",\n\tclasses : [\"ranger\"],\n\tsource : [\"P\", 225],\n\tlevel : 3,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"60-ft cone\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"One piece of ammunition or a thrown weapon\",\n\tduration : \"Instantaneous\",\n\tsave : \"Dex\",\n\tdescription : \"Throw weapon or ammo; copies rain down for 3d8 dmg; dmg type as weapon; save halves\",\n\tdescriptionFull : \"You throw a nonmagical weapon or fire a piece of nonmagical ammunition into the air to create a cone of identical weapons that shoot forward and then disappear. Each creature in a 60-foot cone must succeed on a Dexterity saving throw. A creature takes 3d8 damage on a failed save, or half as much damage on a successful one. The damage type is the same as that of the weapon or ammunition used as a component.\"\n}",
    "conjure volley]": "{\n\tname : \"Conjure Volley\",\n\tclasses : [\"ranger\"],\n\tsource : [\"P\", 226],\n\tlevel : 5,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"150 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"One piece of ammunition or one thrown weapon\",\n\tduration : \"Instantaneous\",\n\tsave : \"Dex\",\n\tdescription : \"Turn ammo/thrown wea into volley; 40-ft rad 20-ft high 8d8 dmg; dmg type as weapon; save halves\",\n\tdescriptionFull : \"You fire a piece of nonmagical ammunition from a ranged weapon or throw a nonmagical weapon into the air and choose a point within range. Hundreds of duplicates of the ammunition or weapon fall in a volley from above and then disappear. Each creature in a 40-foot-radius. 20-foot-high cylinder centered on that point must make a Dexterity saving throw. A creature takes 8d8 damage on a failed save, or half as much damage on a successful one. The damage type is the same as that of the ammunition or weapon.\"\n}",
    "cordon of arrows]": "{\n\tname : \"Cordon of Arrows\",\n\tclasses : [\"ranger\"],\n\tsource : [\"P\", 228],\n\tlevel : 2,\n\tschool : \"Trans\",\n\ttime : \"1 a\",\n\trange : \"5 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"Four or more arrows or bolts\",\n\tduration : \"8 h\",\n\tsave : \"Dex\",\n\tdescription : \"4+2/SL arrows/bolts attack first crea in 30 ft one at a time for 1d6 Piercing dmg; save halves\",\n\tdescriptionFull : \"You plant four pieces of nonmagical ammunition - arrows or crossbow bolts - in the ground within range and lay magic upon them to protect an area. Until the spell ends, whenever a creature other than you comes within 30 feet of the ammunition for the first time on a turn or ends its turn there, one piece of ammunition flies up to strike it. The creature must succeed on a Dexterity saving throw or take 1d6 piercing damage. The piece of ammunition is then destroyed. The spell ends when no ammunition remains.\" + \"\\n   \" + \"When you cast this spell, you can designate any creatures you choose, and the spell ignores them.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 3rd level or higher, the amount of ammunition that can be affected increases by two for each slot level above 2nd.\"\n}",
    "crown of madness]": "{\n\tname : \"Crown of Madness\",\n\tclasses : [\"bard\", \"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"P\", 229],\n\tlevel : 2,\n\tschool : \"Ench\",\n\ttime : \"1 a\",\n\trange : \"120 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Wis\",\n\tdescription : \"1 humanoid save or charmed and must melee attack against crea chosen by you; extra save/rnd\",\n\tdescriptionFull : \"One humanoid of your choice that you can see within range must succeed on a Wisdom saving throw or become charmed by you for the duration. While the target is charmed in this way, a twisted crown of jagged iron appears on its head, and a madness glows in its eyes.\" + \"\\n   \" + \"The charmed target must use its action before moving on each of its turns to make a melee attack against a creature other than itself that you mentally choose. The target can act normally on its turn if you choose no creature or if none are within its reach.\" + \"\\n   \" + \"On your subsequent turns, you must use your action to maintain control over the target, or the spell ends. Also, the target can make a Wisdom saving throw at the end of each of its turns. On a success, the spell ends.\"\n}",
    "crusader's mantle]": "{\n\tname : \"Crusader's Mantle\",\n\tclasses : [\"paladin\"],\n\tsource : [\"P\", 230],\n\tlevel : 3,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"30-ft rad\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"You and allies in range deal extra 1d4 Radiant dmg with weapon attacks\",\n\tdescriptionFull : \"Holy power radiates from you in an aura with a 30-foot radius, awakening boldness in friendly creatures. Until the spell ends, the aura moves with you, centered on you. While in the aura, each non-hostile creature in the aura (including you) deals an extra 1d4 radiant damage when it hits with a weapon attack.\"\n}",
    "destructive wave]": "{\n\tname : \"Destructive Wave\",\n\tclasses : [\"paladin\"],\n\tsource : [\"P\", 231],\n\tlevel : 5,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"30-ft rad\",\n\tcomponents : \"V\",\n\tduration : \"Instantaneous\",\n\tsave : \"Con\",\n\tdescription : \"Any crea 5d6 Thunder + 5d6 Radiant/Necrotic dmg and knocked prone; save halves not prone\",\n\tdescriptionFull : \"You strike the ground, creating a burst of divine energy that ripples outward from you. Each creature you choose within 30 feet of you must succeed on a Constitution saving throw or take 5d6 thunder damage, as well as 5d6 radiant or necrotic damage (your choice), and be knocked prone. A creature that succeeds on its saving throw takes half as much damage and isn't knocked prone.\"\n}",
    "dissonant whispers]": "{\n\tname : \"Dissonant Whispers\",\n\tclasses : [\"bard\"],\n\tsource : [\"P\", 234],\n\tlevel : 1,\n\tschool : \"Ench\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V\",\n\tduration : \"Instantaneous\",\n\tsave : \"Wis\",\n\tdescription : \"1 crea 3d6+1d6/SL Psychic dmg and flee; save halves and no fleeing; deaf crea are immune\",\n\tdescriptionFull : \"You whisper a discordant melody that only one creature of your choice within range can hear, wracking it with terrible pain. The target must make a Wisdom saving throw. On a failed save, it takes 3d6 psychic damage and must immediately use its reaction, if available, to move as far as its speed allows away from you. The creature doesn't move into obviously dangerous ground, such as a fire or a pit. On a successful save, the target takes half as much damage and doesn't have to move away. A deafened creature automatically succeeds on the save.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.\"\n}",
    "elemental weapon]": "{\n\tname : \"Elemental Weapon\",\n\tclasses : [\"paladin\"],\n\tsource : [\"P\", 237],\n\tlevel : 3,\n\tschool : \"Trans\",\n\ttime : \"1 a\",\n\trange : \"Touch\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"+1 magical weapon; +1d4 Acid, Cold, Fire, Lightning, or Thunder dmg; SL5: +2/+2d4, SL7: +3/+3d4\",\n\tdescriptionFull : \"A nonmagical weapon you touch becomes a magic weapon. Choose one of the following damage types - acid, cold, fire, lightning, or thunder. For the duration, the weapon has a +1 bonus to attack rolls and deals an extra 1d4 damage of the chosen type when it hits.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 5th or 6th level, the bonus to attack rolls increases to +2 and the extra damage increases to 2d4. When you use a spell slot of 7th level or higher, the bonus increases to +3 and the extra damage increases to 3d4.\"\n}",
    "ensnaring strike]": "{\n\tname : \"Ensnaring Strike\",\n\tclasses : [\"ranger\"],\n\tsource : [\"P\", 237],\n\tlevel : 1,\n\tschool : \"Conj\",\n\ttime : \"1 bns\",\n\trange : \"Self\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Str\",\n\tdescription : \"Next crea hit save (Large adv.) or restrained, 1d6+1d6/SL Piercing dmg/rnd; Str check to escape\",\n\tdescriptionFull : \"The next time you hit a creature with a weapon attack before this spell ends, a writhing mass of thorny vines appears at the point of impact, and the target must succeed on a Strength saving throw or be restrained by the magical vines until the spell ends. A Large or larger creature has advantage on this saving throw. If the target succeeds on the save, the vines shrivel away.\" + \"\\n   \" + \"While restrained by this spell, the target takes 1d6 piercing damage at the start of each of its turns. A creature restrained by the vines or one that can touch the creature can use its action to make a Strength check against your spell save DC. On a success, the target is freed.\" + AtHigherLevels + \"If you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.\"\n}",
    "feign death]": "{\n\tname : \"Feign Death\",\n\tclasses : [\"bard\", \"cleric\", \"druid\", \"wizard\"],\n\tsource : [\"P\", 240],\n\tritual : true,\n\tlevel : 3,\n\tschool : \"Necro\",\n\ttime : \"1 a\",\n\trange : \"Touch\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A pinch of graveyard dirt\",\n\tduration : \"1 h (D)\",\n\tdescription : \"Willing creature appears dead; it is blinded, incapacitated, has dmg resist. all but Psychic, and speed 0\",\n\tdescriptionFull : \"You touch a willing creature and put it into a cataleptic state that is indistinguishable from death.\" + \"\\n   \" + \"For the spell's duration, or until you use an action to touch the target and dismiss the spell, the target appears dead to all outward inspection and to spells used to determine the target's status. The target is blinded and incapacitated, and its speed drops to 0. The target has resistance to all damage except psychic damage. If the target is diseased or poisoned when you cast the spell, or becomes diseased or poisoned while under the spell's effect, the disease and poison have no effect until the spell ends.\"\n}",
    "friends]": "{\n\tname : \"Friends\",\n\tclasses : [\"bard\", \"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"P\", 244],\n\tlevel : 0,\n\tschool : \"Ench\",\n\ttime : \"1 a\",\n\trange : \"Self\",\n\tcomponents : \"S,M\",\n\tcompMaterial : \"A small amount of makeup applied to the face as this spell is cast\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"Adv. on Cha checks vs. 1 crea currently not hostile; when spell ends, crea knows and becomes hostile\",\n\tdescriptionFull : \"For the duration, you have advantage on all Charisma checks directed at one creature of your choice that isn't hostile toward you. When the spell ends, the creature realizes that you used magic to influence its mood and becomes hostile toward you. A creature prone to violence might attack you. Another creature might seek retribution in other ways (at the DM's discretion), depending on the nature of your interaction with it.\"\n}",
    "grasping vine]": "{\n\tname : \"Grasping Vine\",\n\tclasses : [\"druid\", \"ranger\"],\n\tsource : [\"P\", 246],\n\tlevel : 4,\n\tschool : \"Conj\",\n\ttime : \"1 bns\",\n\trange : \"30 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Dex\",\n\tdescription : \"Conjure vine with 30 ft reach; bns a to direct to 1 crea save or pulled 20 ft to vine\",\n\tdescriptionFull : \"You conjure a vine that sprouts from the ground in an unoccupied space of your choice that you can see within range. When you cast this spell, you can direct the vine to lash out at a creature within 30 feet of it that you can see. That creature must succeed on a Dexterity saving throw or be pulled 20 feet directly toward the vine.\" + \"\\n   \" + \"Until the spell ends, you can direct the vine to lash out at the same creature or another one as a bonus action on each of your turns.\"\n}",
    "hail of thorns]": "{\n\tname : \"Hail of Thorns\",\n\tclasses : [\"ranger\"],\n\tsource : [\"P\", 249],\n\tlevel : 1,\n\tschool : \"Conj\",\n\ttime : \"1 bns\",\n\trange : \"Self\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Dex\",\n\tdescription : \"Next ranged weapon attack, all within 5 ft of target 1d10+1d10/SL Piercing dmg; save halves\",\n\tdescriptionFull : \"The next time you hit a creature with a ranged weapon attack before the spell ends, this spell creates a rain of thorns that sprouts from your ranged weapon or ammunition. In addition to the normal effect of the attack, the target of the attack and each creature within 5 feet of it must make a Dexterity saving throw. A creature takes 1d10 piercing damage on a failed save, or half as much damage on a successful one.\" + AtHigherLevels + \"If you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d10 for each slot level above 1st (to a maximum of 6d10).\"\n}",
    "hex]": "{\n\tname : \"Hex\",\n\tclasses : [\"warlock\"],\n\tsource : [\"P\", 251],\n\tlevel : 1,\n\tschool : \"Ench\",\n\ttime : \"1 bns\",\n\trange : \"90 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"The petrified eye of a newt\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"1 crea +1d6 Necrotic dmg from your atks; dis. on chosen ability checks; SL3: conc, 8h; SL5: conc, 24h\",\n\tdescriptionFull : \"You place a curse on a creature that you can see within range. Until the spell ends, you deal an extra 1d6 necrotic damage to the target whenever you hit it with an attack. Also, choose one ability when you cast the spell. The target has disadvantage on ability checks made with the chosen ability.\" + \"\\n   \" + \"If the target drops to 0 hit points before this spell ends, you can use a bonus action on a subsequent turn of yours to curse a new creature.\" + \"\\n   \" + \"A remove curse cast on the target ends this spell early.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 3rd or 4th level, you can maintain your concentration on the spell for up to 8 hours. When you use a spell slot of 5th level or higher, you can maintain your concentration on the spell for up to 24 hours.\"\n}",
    "hunger of hadar]": "{\n\tname : \"Hunger of Hadar\",\n\tclasses : [\"warlock\"],\n\tsource : [\"P\", 251],\n\tlevel : 3,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"150 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A pickled octopus tentacle\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Dex\",\n\tdescription : \"20-ft rad blinds all while in; all start turn in 2d6 Cold dmg; all end turn in save or 2d6 Acid dmg\",\n\tdescriptionFull : \"You open a gateway to the dark between the stars, a region infested with unknown horrors. A 20-foot-radius sphere of blackness and bitter cold appears, centered on a point with range and lasting for the duration. This void is filled with a cacophony of soft whispers and slurping noises that can be heard up to 30 feet away. No light, magical or otherwise, can illuminate the area, and creatures fully within the area are blinded.\" + \"\\n   \" + \"The void creates a warp in the fabric of space, and the area is difficult terrain. Any creature that starts its turn in the area takes 2d6 cold damage. Any creature that ends its turn in the area must succeed on a Dexterity saving throw or take 2d6 acid damage as milky, otherworldly tentacles rub against it.\"\n}",
    "lightning arrow]": "{\n\tname : \"Lightning Arrow\",\n\tclasses : [\"ranger\"],\n\tsource : [\"P\", 255],\n\tlevel : 3,\n\tschool : \"Trans\",\n\ttime : \"1 bns\",\n\trange : \"Self\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Dex\",\n\tdescription : \"Next rngd wea atk +4d8+1d8/SL Lightn. dmg, miss half; 10 ft all 2d8+1d8/SL Lightn. dmg, save half\",\n\tdescriptionFull : \"The next time you make a ranged weapon attack during the spell's duration, the weapon's ammunition, or the weapon itself if it's a thrown weapon, transforms into a bolt of lightning. Make the attack roll as normal. The target takes 4d8 lightning damage on a hit, or half as much damage on a miss, instead of the weapon's normal damage.\" + \"\\n   \" + \"Whether you hit or miss, each creature within 10 feet of the target must make a Dexterity saving throw. Each of these creatures takes 2d8 lightning damage on a failed save, or half as much damage on a successful one.\" + \"\\n   \" + \"The piece of ammunition or weapon then returns to its normal form.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 4th level or higher, the damage for both effects of the spell increases by 1d8 for each slot level above 3rd.\"\n}",
    "phantasmal force]": "{\n\tname : \"Phantasmal Force\",\n\tclasses : [\"bard\", \"sorcerer\", \"wizard\"],\n\tsource : [\"P\", 264],\n\tlevel : 2,\n\tschool : \"Illus\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A bit of fleece\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Int\",\n\tdescription : \"1 crea save or sees 10 ft cube illusion that does 1d6 Psychic dmg/rnd; Int(Investigation) vs. Spell DC\",\n\tdescriptionFull : \"You craft an illusion that takes root in the mind of a creature that you can see within range. The target must make an Intelligence saving throw. On a failed save, you create a phantasmal object, creature, or other visible phenomenon of your choice that is no larger than a 10-foot cube and that is perceivable only to the target for the duration. This spell has no effect on undead or constructs.\" + \"\\n   \" + \"The phantasm includes sound, temperature, and other stimuli, also evident only to the creature.\" + \"\\n   \" + \"The target can use its action to examine the phantasm with an Intelligence (Investigation) check against your spell save DC. If the check succeeds, the target realizes that the phantasm is an illusion, and the spell ends.\" + \"\\n   \" + \"While a target is affected by the spell, the target treats the phantasm as if it were real. The target rationalizes any illogical outcomes from interacting with the phantasm. For example, a target attempting to walk across a phantasmal bridge that spans a chasm falls once it steps onto the bridge. If the target survives the fall, it still believes that the bridge exists and comes up with some other explanation for its fall - it was pushed, it slipped, or a strong wind might have knocked it off.\" + \"\\n   \" + \"An affected target is so convinced of the phantasm's reality that it can even take damage from the illusion. A phantasm created to appear as a creature can attack the target. Similarly, a phantasm created to appear as fire, a pool of acid, or lava can burn the target. Each round on your turn, the phantasm can deal 1d6 psychic damage to the target if it is in the phantasm's area or within 5 feet of the phantasm, provided that the illusion is of a creature or hazard that could logically deal damage, such as by attacking. The target perceives the damage as a type appropriate to the illusion.\"\n}",
    "power word heal]": "{\n\tname : \"Power Word Heal\",\n\tclasses : [\"bard\"],\n\tsource : [\"P\", 266],\n\tlevel : 9,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"Touch\",\n\tcomponents : \"V,S\",\n\tduration : \"Instantaneous\",\n\tdescription : \"1 crea heals all hp and stops being charmed, frightened, paralyzed, stunned; it can use rea to stand up\",\n\tdescriptionFull : \"A wave of healing energy washes over the creature you touch. The target regains all its hit points. If the creature is charmed, frightened, paralyzed, or stunned, the condition ends. If the creature is prone, it can use its reaction to stand up. This spell has no effect on undead or constructs.\"\n}",
    "ray of sickness]": "{\n\tname : \"Ray of Sickness\",\n\tclasses : [\"sorcerer\", \"wizard\"],\n\tsource : [\"P\", 271],\n\tlevel : 1,\n\tschool : \"Necro\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Instantaneous\",\n\tsave : \"Con\",\n\tdescription : \"Spell attack for 2d8+1d8/SL Poison dmg; save or also poisoned until end of your next turn\",\n\tdescriptionFull : \"A ray of sickening greenish energy lashes out toward a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 2d8 poison damage and must make a Constitution saving throw. On a failed save, it is also poisoned until the end of your next turn.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.\"\n}",
    "searing smite]": "{\n\tname : \"Searing Smite\",\n\tclasses : [\"paladin\"],\n\tsource : [\"P\", 274],\n\tlevel : 1,\n\tschool : \"Evoc\",\n\ttime : \"1 bns\",\n\trange : \"Self\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Con\",\n\tdescription : \"Next melee weapon hit +1d6+1d6/SL Fire dmg and target ignites; save to end spell or 1d6 Fire dmg\",\n\tdescriptionFull : \"The next time you hit a creature with a melee weapon attack during the spell's duration, your weapon flares with white-hot intensity, and the attack deals an extra 1d6 fire damage to the target and causes the target to ignite in flames. At the start of each of its turns until the spell ends, the target must make a Constitution saving throw. On a failed save, it takes 1d6 fire damage. On a successful save, the spell ends. If the target or a creature within 5 feet of it uses an action to put out the flames, or if some other effect douses the flames (such as the target being submerged in water), the spell ends.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 2nd level or higher, the initial extra damage dealt by the attack increases by 1d6 for each slot above the 1st.\"\n}",
    "staggering smite]": "{\n\tname : \"Staggering Smite\",\n\tclasses : [\"paladin\"],\n\tsource : [\"P\", 278],\n\tlevel : 4,\n\tschool : \"Evoc\",\n\ttime : \"1 bns\",\n\trange : \"Self\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Wis\",\n\tdescription : \"Next melee weapon hit +4d6 Psychic dmg and save or dis. on atks/chks, no rea, until end next turn\",\n\tdescriptionFull : \"The next time you hit a creature with a melee weapon attack during this spell's duration, your weapon pierces both body and mind, and the attack deals an extra 4d6 psychic damage to the target. The target must make a Wisdom saving throw. On a failed save, it has disadvantage on attack rolls and ability checks, and can't take reactions, until the end of its next turn.\"\n}",
    "swift quiver]": "{\n\tname : \"Swift Quiver\",\n\tclasses : [\"ranger\"],\n\tsource : [\"P\", 279],\n\tlevel : 5,\n\tschool : \"Trans\",\n\ttime : \"1 bns\",\n\trange : \"Touch\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A quiver containing at least one piece of ammunition\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"Quiver gives nonmagical ammo; bns a to make 2 atks with weapon that uses ammo from that quiver\",\n\tdescriptionFull : \"You transmute your quiver so it produces an endless supply of nonmagical ammunition, which seems to leap into your hand when you reach for it.\" + \"\\n   \" + \"On each of your turns until the spell ends, you can use a bonus action to make two attacks with a weapon that uses ammunition from the quiver. Each time you make such a ranged attack, your quiver magically replaces the piece of ammunition you used with a similar piece of nonmagical ammunition. Any pieces of ammunition created by this spell disintegrate when the spell ends. If the quiver leaves your possession, the spell ends.\"\n}",
    "telepathy]": "{\n\tname : \"Telepathy\",\n\tclasses : [\"wizard\"],\n\tsource : [\"P\", 281],\n\tlevel : 8,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"Unlimited\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A pair of linked silver rings\",\n\tduration : \"24 h\",\n\tdescription : \"1 willing crea Int>0 and you telepathic link; share words, sensory information if on same plane\",\n\tdescriptionFull : \"You create a telepathic link between yourself and a willing creature with which you are familiar. The creature can be anywhere on the same plane of existence as you. The spell ends if you or the target are no longer on the same plane.\" + \"\\n   \" + \"Until the spell ends, you and the target can instantaneously share words, images, sounds, and other sensory messages with one another through the link, and the target recognizes you as the creature it is communicating with. The spell enables a creature with an Intelligence score of at least 1 to understand the meaning of your words and take in the scope of any sensory messages you send to it.\"\n}",
    "thorn whip]": "{\n\tname : \"Thorn Whip\",\n\tclasses : [\"druid\"],\n\tsource : [\"P\", 282],\n\tlevel : 0,\n\tschool : \"Trans\",\n\ttime : \"1 a\",\n\trange : \"30 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"The stem of a plant with thorns\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Melee spell attack for 1d6 Piercing dmg and pull crea 10 ft to you; +1d6 at CL 5, 11, and 17\",\n\tdescriptionFull : \"You create a long, vine-like whip covered in thorns that lashes out at your command toward a creature in range. Make a melee spell attack against the target. If the attack hits, the creature takes 1d6 piercing damage, and if the creature is Large or smaller, you pull the creature up to 10 feet closer to you.\" + \"\\n   \" + \"This spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).\"\n}",
    "thunderous smite]": "{\n\tname : \"Thunderous Smite\",\n\tclasses : [\"paladin\"],\n\tsource : [\"P\", 282],\n\tlevel : 1,\n\tschool : \"Evoc\",\n\ttime : \"1 bns\",\n\trange : \"Self\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Str\",\n\tdescription : \"Next melee weapon hit +2d6 Thunder dmg and save or 10 ft push and prone; audible in 300 ft\",\n\tdescriptionFull : \"The first time you hit with a melee weapon attack during this spell's duration, your weapon rings with thunder that is audible within 300 feet of you, and the attack deals an extra 2d6 thunder damage to the target. Additionally, if the target is a creature, it must succeed on a Strength saving throw or be pushed 10 feet away from you and knocked prone.\"\n}",
    "tsunami]": "{\n\tname : \"Tsunami\",\n\tclasses : [\"druid\"],\n\tsource : [\"P\", 284],\n\tlevel : 8,\n\tschool : \"Conj\",\n\ttime : \"1 min\",\n\trange : \"Sight\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 6 rnd\",\n\tsave : \"Str\",\n\tdescription : \"300\\u00D750\\u00D7300ft (l\\u00D7w\\u00D7h) wall of water moves away at 50 ft/rnd; 6d10 Bludg. dmg; save halves; see B\",\n\tdescriptionMetric : \"90\\u00D715\\u00D790m (l\\u00D7w\\u00D7h) wall of water moves away at 15 m/rnd; 6d10 Bludg. dmg; save halves; see B\",\n\tdescriptionFull : \"A wall of water springs into existence at a point you choose within range. You can make the wall up to 300 feet long, 300 feet high, and 50 feet thick. The wall lasts for the duration.\" + \"\\n   \" + \"When the wall appears, each creature within its area must make a Strength saving throw. On a failed save, a creature takes 6d10 bludgeoning damage, or half as much damage on a successful save.\" + \"\\n   \" + \"At the start of each of your turns after the wall appears, the wall, along with any creatures in it, moves 50 feet away from you. Any Huge or smaller creature inside the wall or whose space the wall enters when it moves must succeed on a Strength saving throw or take 5d10 bludgeoning damage. A creature can take this damage only once per round. At the end of the turn, the wall's height is reduced by 50 feet, and the damage creatures take from the spell on subsequent rounds is reduced by 1d10. When the wall reaches 0 feet in height, the spell ends.\" + \"\\n   \" + \"A creature caught in the wall can move by swimming. Because of the force of the wave, though, the creature must make a successful Strength (Athletics) check against your spell save DC in order to move at all. If it fails the check, it can't move. A creature that moves out of the area falls to the ground.\"\n}",
    "witch bolt]": "{\n\tname : \"Witch Bolt\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"P\", 289],\n\tlevel : 1,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"30 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A twig from a tree that has been struck by lightning\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"Spell attack 1d12+1d12/SL Lightning dmg; 1 a, if consecutive, for dmg again; ends if out of range\",\n\tdescriptionFull : \"A beam of crackling, blue energy lances out toward a creature within range, forming a sustained arc of lightning between you and the target. Make a ranged spell attack against that creature. On a hit, the target takes 1d12 lightning damage, and on each of your turns for the duration, you can use your action to deal 1d12 lightning damage to the target automatically. The spell ends if you use your action to do anything else. The spell also ends if the target is ever outside the spell's range or if it has total cover from you.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 2nd level or higher, the initial damage increases by 1d12 for each slot level above 1st.\"\n}",
    "wrathful smite]": "{\n\tname : \"Wrathful Smite\",\n\tclasses : [\"paladin\"],\n\tsource : [\"P\", 289],\n\tlevel : 1,\n\tschool : \"Evoc\",\n\ttime : \"1 bns\",\n\trange : \"Self\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Wis\",\n\tdescription : \"Next melee weapon hit +1d6 Psychic dmg and save or frightened; it can take 1 a for extra save\",\n\tdescriptionFull : \"The next time you hit with a melee weapon attack during this spell's duration, your attack deals an extra 1d6 psychic damage. Additionally, if the target is a creature, it must make a Wisdom saving throw or be frightened of you until the spell ends. As an action, the creature can make a Wisdom check against your spell save DC to steel its resolve and end this spell.\"\n}",
    "abi-dalzim's horrid wilting]": "{\n\t\tname : \"Abi-Dalzim's Horrid Wilting\",\n\t\tnameShort : \"Abi-D's Horrid Wilting\",\n\t\tnameAlt : \"Horrid Wilting\",\n\t\tclasses : [\"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 150], [\"E\", 15]],\n\t\tlevel : 8,\n\t\tschool : \"Necro\",\n\t\ttime : \"1 a\",\n\t\trange : \"150 ft\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"A bit of sponge\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Con\",\n\t\tdescription : \"30-ft cube all crea 12d8 Necrotic dmg; save halves; plants/water elem. dis. const/undead immune\",\n\t\tdescriptionFull : \"You draw the moisture from every creature in a 30-foot cube centered on a point you choose within range. Each creature in that area must make a Constitution saving throw. Constructs and undead aren't affected, and plants and water elementals make this saving throw with disadvantage. A creature takes 12d8 necrotic damage on a failed save, or half as much damage on a successful one.\" + \"\\n   \" + \"Nonmagical plants in the area that aren't creatures, such as trees and shrubs, wither and die instantly.\"\n\t}",
    "absorb elements]": "{\n\t\tname : \"Absorb Elements\",\n\t\tclasses : [\"druid\", \"ranger\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 150], [\"E\", 15]],\n\t\tlevel : 1,\n\t\tschool : \"Abjur\",\n\t\ttime : \"1 rea\",\n\t\trange : \"Self\",\n\t\tcomponents : \"S\",\n\t\tduration : \"1 rnd\",\n\t\tdescription : \"Acid, Cold, Fire, Lightning, or Thunder resistance vs. 1 atk; first melee hit next rnd +1d6+1d6/SL dmg\",\n\t\tdescriptionFull : \"The spell captures some of the incoming energy, lessening its effect on you and storing it for your next melee attack. You have resistance to the triggering damage type until the start of your next turn. Also, the first time you hit with a melee attack on your next turn, the target takes an extra 1d6 damage of the triggering type, and the spell ends.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 2nd level or higher, the extra damage increases by 1d6 for each slot level above 1st.\"\n\t}",
    "aganazzar's scorcher]": "{\n\t\tname : \"Aganazzar's Scorcher\",\n\t\tnameAlt : \"Scorch\", //as per the Spell Compandium's (DnD 3.5e) alternative name\n\t\tclasses : [\"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 150], [\"E\", 15]],\n\t\tlevel : 2,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"30-ft line\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"A red dragon's scale\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"30-ft long 5-ft wide line all creatures 3d8+1d8/SL Fire dmg; save halves\",\n\t\tdescriptionFull : \"A line of roaring flame 30 feet long and 5 feet wide emanates from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 3d8 fire damage on a failed save, or half as much damage on a successful one.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.\"\n\t}",
    "beast bond]": "{\n\t\tname : \"Beast Bond\",\n\t\tclasses : [\"druid\", \"ranger\"],\n\t\tsource : [[\"X\", 150], [\"E\", 15]],\n\t\tlevel : 1,\n\t\tschool : \"Div\",\n\t\ttime : \"1 a\",\n\t\trange : \"Touch\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"A bit of fur wrapped in a cloth\",\n\t\tduration : \"Conc, 10 min\",\n\t\tdescription : \"Telepathic link with 1 beast Int<4 while in line of sight; beast has adv. on attacks vs. crea you can see\",\n\t\tdescriptionFull : \"You establish a telepathic link with one beast you touch that is friendly to you or charmed by you. The spell fails if the beast's Intelligence is 4 or higher. Until the spell ends, the link is active while you and the beast are within line of sight of each other. Through the link, the beast can understand your telepathic messages to it, and it can telepathically communicate simple emotions and concepts back to you. While the link is active, the beast gains advantage on attack rolls against any creature within 5 feet of you that you can see.\"\n\t}",
    "bones of the earth]": "{\n\t\tname : \"Bones of the Earth\",\n\t\tclasses : [\"druid\"],\n\t\tsource : [[\"X\", 150], [\"E\", 15]],\n\t\tlevel : 6,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"120 ft\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"6+2/SL 2.5-ft rad ground burst up 30-ft, \\u2265 Med. creas save or lifted, 6d6 bludg. dmg if ceiling; see B\",\n\t\tdescriptionFull : \"You cause up to six pillars of stone to burst from places on the ground that you can see within range. Each pillar is a cylinder that has a diameter of 5 feet and a height of up to 30 feet. The ground where a pillar appears must be wide enough for its diameter, and you can target the ground under a creature if that creature is Medium or smaller. Each pillar has AC 5 and 30 hit points. When reduced to 0 hit points, a pillar crumbles into rubble, which creates an area of difficult terrain with a 10-foot radius that lasts until the rubble is cleared. Each 5-foot-diameter portion of the area requires at least 1 minute to clear by hand.\" + \"\\n   \" + \"If a pillar is created under a creature, that creature must succeed on a Dexterity saving throw or be lifted by the pillar. A creature can choose to fail the save.\" + \"\\n   \" + \"If a pillar is prevented from reaching its full height because of a ceiling or other obstacle, a creature on the pillar takes 6d6 bludgeoning damage and is restrained, pinched between the pillar and the obstacle. The restrained creature can use an action to make a Strength or Dexterity check (the creature's choice) against the spell's save DC. On a success, the creature is no longer restrained and must either move off the pillar or fall off it.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 7th level or higher, you can create.\"\n\t}",
    "catapult]": "{\n\t\tname : \"Catapult\",\n\t\tclasses : [\"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 150], [\"E\", 15]],\n\t\tlevel : 1,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"60 ft\",\n\t\tcomponents : \"S\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"Send 5+5/SL lb unattended object in 90 ft straight line; if hits crea, save or 3d8+1d8/SL Bludg. dmg\",\n\t\tdescriptionFull : \"Choose one object weighing 1 to 5 pounds within range that isn't being worn or carried. The object flies in a straight line up to 90 feet in a direction you choose before falling to the ground, stopping early if it impacts against a solid surface. If the object would strike a creature, that creature must make a Dexterity saving throw. On a failed save, the object strikes the target and stops moving. When the object strikes something, the object and what it strikes each take 3d8 bludgeoning damage.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 2nd level or higher, the maximum weight of objects that you can target with this spell increases by 5 pounds, and the damage.\"\n\t}",
    "control flames]": "{\n\t\tname : \"Control Flames\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 152], [\"E\", 16]],\n\t\tlevel : 0,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"60 ft\",\n\t\tcomponents : \"S\",\n\t\tduration : \"Instant. or 1 h\",\n\t\tdescription : \"Nonmagical flame up to 5 cu ft; instant: expand/exinguish, 1h: brighten/dim/color/create shapes\",\n\t\tdescriptionFull : \"You choose nonmagical flame that you can see within range and that fits within a 5-foot cube. You affect it in one of the following ways.\" + \"\\n \\u2022 \" + \"You instantaneously expand the flame 5 feet in one direction, provided that wood or other fuel is present in the new location.\" + \"\\n \\u2022 \" + \"You instantaneously extinguish the flames within the cube.\" + \"\\n \\u2022 \" + \"You double or halve the area of bright light and dim light cast by the flame, change its color, or both. The change lasts for 1 hour.\" + \"\\n \\u2022 \" + \"You cause simple shapes-such as the vague form of a creature, an inanimate object, or a location-to appear within the flames and animate as you like. The shapes last for 1 hour.\" + \"\\n   \" + \"If you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.\"\n\t}",
    "control winds]": "{\n\t\tname : \"Control Winds\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 152], [\"E\", 16], [\"UA:D\", 8]],\n\t\tlevel : 5,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"300 ft\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Conc, 1 h\",\n\t\tdescription : \"100-ft cube of air either gusts, downdraft, or updraft; affects flying/jump/ranged; 1 a change; see B\",\n\t\tdescriptionFull : \"You take control of the air in a 100-foot cube that you can see within range. Choose one of the following effects when you cast the spell. The effect lasts for the spell's duration, unless you use your action on a later turn to switch to a different effect. You can also use your action to temporarily halt the effect or to restart one you've halted.\" + \"\\n   \" + toUni(\"Gusts\") + \": A wind picks up within the cube, continually blowing in a horizontal direction you designate. You choose the intensity of the wind: calm, moderate, or strong. If the wind is moderate or strong, ranged weapon attacks that enter or leave the cube or pass through it have disadvantage on their attack rolls. If the wind is strong, any creature moving against the wind must spend 1 extra foot of movement for each foot moved.\" + \"\\n   \" + toUni(\"Downdraft\") + \": You cause a sustained blast of strong wind to blow downward from the top of the cube. Ranged weapon attacks that pass through the cube or that are made against targets within it have disadvantage on their attack rolls. A creature must make a Strength saving throw if it flies into the cube for the first time on a turn or starts its turn there flying. On a failed save, the creature is knocked prone.\" + \"\\n   \" + toUni(\"Updraft\") + \": You cause a sustained updraft within the cube, rising upward from the cube's bottom side. Creatures that end a fall within the cube take only half damage from the fall. When a creature in the cube makes a vertical jump, the creature can jump up to 10 feet higher than normal.\"\n\t}",
    "create bonfire]": "{\n\t\tname : \"Create Bonfire\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"warlock\", \"wizard\"],\n\t\tsource : [[\"X\", 152], [\"E\", 16]],\n\t\tlevel : 0,\n\t\tschool : \"Conj\",\n\t\ttime : \"1 a\",\n\t\trange : \"60 ft\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Conc, 1 min\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"5-ft cube all crea at casting or entering save or 1d8 Fire dmg; ignites flammable; +1d8 at CL 5/11/17\",\n\t\tdescriptionFull : \"You create a bonfire on ground that you can see within range. Until the spell ends, the magic bonfire fills a 5-foot cube. Any creature in the bonfire's space when you cast the spell must succeed on a Dexterity saving throw or take 1d8 fire damage. A creature must also make the saving throw when it moves into the bonfire's space for the first time on a turn or ends its turn there.\" + \"\\n   \" + \"The bonfire ignites flammable objects in its area that aren't being worn or carried.\" + \"\\n   \" + \"The spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).\"\n\t}",
    "dust devil]": "{\n\t\tname : \"Dust Devil\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 154], [\"E\", 17]],\n\t\tlevel : 2,\n\t\tschool : \"Conj\",\n\t\ttime : \"1 a\",\n\t\trange : \"60 ft\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"A pinch of dust\",\n\t\tduration : \"Conc, 1 min\",\n\t\tsave : \"Str\",\n\t\tdescription : \"5-ft cube; all in 5-ft 1d8+1d8/SL Bludg. dmg and pushed 10 ft away; save halves, no push; see book\",\n\t\tdescriptionFull : \"Choose an unoccupied 5-foot cube of air that you can see within range. An elemental force that resembles a dust devil appears in the cube and lasts for the spell's duration.\" + \"\\n   \" + \"Any creature that ends its turn within 5 feet of the dust devil must make a Strength saving throw. On a failed save, the creature takes 1d8 bludgeoning damage and is pushed 10 feet away from the dust devil. On a successful save, the creature takes half as much damage and isn't pushed.\" + \"\\n   \" + \"As a bonus action, you can move the dust devil up to 30 feet in any direction. If the dust devil moves over sand, dust, loose dirt, or light gravel, it sucks up the material and forms a 10-foot-radius cloud of debris around itself that lasts until the start of your next turn. The cloud heavily obscures its area.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.\"\n\t}",
    "earthbind]": "{\n\t\tname : \"Earthbind\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"warlock\", \"wizard\"],\n\t\tsource : [[\"X\", 154], [\"E\", 17]],\n\t\tlevel : 2,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"300 ft\",\n\t\tcomponents : \"V\",\n\t\tduration : \"Conc, 1 min\",\n\t\tsave : \"Str\",\n\t\tdescription : \"1 creatures save or fly speed is reduced to 0; airborne creatures safely descend at 60 ft per round\",\n\t\tdescriptionFull : \"Choose one creature you can see within range. Yellow strips of magical energy loop around the creature. The target must succeed on a Strength saving throw, or its flying speed (if any) is reduced to 0 feet for the spell's duration. An airborne creature affected by this spell safely descends at 60 feet per round until it reaches the ground or the spell ends.\"\n\t}",
    "earth tremor]": "{\n\t\tname : \"Earth Tremor\",\n\t\tclasses : [\"bard\", \"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 155], [\"E\", 17]],\n\t\tlevel : 1,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"10 ft\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"All crea in range except you save or 1d6+1d6/SL Bludgeoning dmg and prone; loose ground is dif. ter.\",\n\t\tdescriptionFull : \"You cause a tremor in the ground within range. Each creature other than you in that area must make a Dexterity saving throw. On a failed save, a creature takes 1d6 bludgeoning damage and is knocked prone. If the ground in that area is loose earth or stone, it becomes difficult terrain until cleared, with each 5-foot-diameter portion requiring at least 1 minute to clear by hand.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.\"\n\t}",
    "elemental bane]": "{\n\t\tname : \"Elemental Bane\",\n\t\tclasses : [\"druid\", \"warlock\", \"wizard\"],\n\t\tsource : [[\"X\", 155], [\"E\", 17]],\n\t\tlevel : 4,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"90 ft\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Conc, 1 min\",\n\t\tsave : \"Con\",\n\t\tdescription : \"1+1/SL crea, each max 30 ft apart, save or 1 energy: lose resist. to it & +2d6 to first dmg with it/turn\",\n\t\tdescriptionFull : \"Choose one creature you can see within range, and choose one of the following damage types - acid, cold, fire, lightning, or thunder. The target must succeed on a Constitution saving throw or be affected by the spell for its duration. The first time each turn the affected target takes damage of the chosen type, the target takes an extra 2d6 damage of that type. Moreover, the target loses any resistance to that damage type until the spell ends.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The creatures must be within 30 feet of each other when you target them.\"\n\t}",
    "erupting earth]": "{\n\t\tname : \"Erupting Earth\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 155], [\"E\", 17]],\n\t\tlevel : 3,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"120 ft\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"A piece of obsidian\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"20-ft cube all crea 3d12+1d12/SL Bludgeoning dmg; save halves; area becomes difficult terrain\",\n\t\tdescriptionFull : \"Choose a point you can see on the ground within range. A fountain of churned earth and stone erupts in a 20-foot cube centered on that point. Each creature in that area must make a Dexterity saving throw. A creature takes 3d12 bludgeoning damage on a failed save, or half as much damage on a successful one. Additionally, the ground in that area becomes difficult terrain until cleared. Each 5-foot-square portion of the area requires at least 1 minute to clear by hand.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d12 for each slot level above 3rd.\"\n\t}",
    "flame arrows]": "{\n\t\tname : \"Flame Arrows\",\n\t\tclasses : [\"druid\", \"ranger\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 156], [\"E\", 18]],\n\t\tlevel : 3,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"Touch\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Conc, 1 h\",\n\t\tdescription : \"12+2/SL ammunition drawn from touched quiver do +1d6 Fire damage on a successful hit\",\n\t\tdescriptionFull : \"You touch a quiver containing arrows or bolts. When a target is hit by a ranged weapon attack using a piece of ammunition drawn from the quiver, the target takes an extra 1d6 fire damage. The spell's magic ends on the piece of ammunition when it hits or misses, and the spell ends when twelve pieces of ammunition have been drawn from the quiver.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 4th level or higher, the number of pieces of ammunition you can affect with this spell increases by two for each slot level above 3rd.\"\n\t}",
    "frostbite]": "{\n\t\tname : \"Frostbite\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"warlock\", \"wizard\"],\n\t\tsource : [[\"X\", 156], [\"E\", 18]],\n\t\tlevel : 0,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"60 ft\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Con\",\n\t\tdescription : \"1 crea save or 1d6 Cold dmg and dis. on next weapon attack roll; +1d6 at CL 5, 11, and 17\",\n\t\tdescriptionFull : \"You cause numbing frost to form on one creature that you can see within range. The target must make a Constitution saving throw. On a failed save, the target takes 1d6 cold damage, and it has disadvantage on the next weapon attack roll it makes before the end of its next turn.\" + \"\\n   \" + \"The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).\"\n\t}",
    "gust]": "{\n\t\tname : \"Gust\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"WGtE\", 107], [\"X\", 157], [\"E\", 19], [\"UA:D\", 6]],\n\t\tlevel : 0,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"30 ft\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Str\",\n\t\tdescription : \"Med. or smaller crea save or push 5 ft; or push unattended 5 lb obj 10 ft; or harmless sensory effect\",\n\t\tdescriptionFull : \"You seize the air and compel it to create one of the following effects at a point you can see within range.\" + \"\\n \" + \"\\u2022 One Medium or smaller creature that you choose must succeed on a Strength saving throw or be pushed up to 5 feet away from you.\" + \"\\n \" + \"\\u2022 You create a small blast of air capable of moving one object that is neither held nor carried and that weighs no more than 5 pounds. The object is pushed up to 10 feet away from you. It isn't pushed with enough force to cause damage.\" + \"\\n \" + \"\\u2022 You create a harmless sensory affect using air, such as causing leaves to rustle, wind to slam shutters shut, or your clothing to ripple in a breeze.\"\n\t}",
    "ice knife]": "{\n\t\tname : \"Ice Knife\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 157], [\"E\", 19]],\n\t\tlevel : 1,\n\t\tschool : \"Conj\",\n\t\ttime : \"1 a\",\n\t\trange : \"60 ft\",\n\t\tcomponents : \"S,M\",\n\t\tcompMaterial : \"A drop of water or piece of ice\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"Ranged atk for 1d10 Piercing dmg; hit/miss 5-ft rad on target all crea save or 2d6+1d6/SL Cold dmg\",\n\t\tdescriptionFull : \"You create a shard of ice and fling it at one creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 piercing damage. Hit or miss, the shard then explodes. The target and each creature within 5 feet of it must succeed on a Dexterity saving throw or take 2d6 cold damage.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 2nd level or higher, the cold damage increases by 1d6 for each slot level above 1st.\"\n\t}",
    "immolation]": "{\n\t\tname : \"Immolation\",\n\t\tclasses : [\"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 158], [\"E\", 19]],\n\t\tlevel : 5,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"90 ft\",\n\t\tcomponents : \"V\",\n\t\tduration : \"Conc, 1 min\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"1 crea save or 8d6 Fire dmg and burns for 4d6 Fire dmg/rnd; save each rnd to end; half dmg on save\",\n\t\tdescriptionFull : \"Flames wreathe one creature you can see within range. The target must make a Dexterity saving throw. It takes 8d6 fire damage on a failed save, or half as much damage on a successful one. On a failed save, the target also burns for the spell's duration. The burning target sheds bright light in a 30-foot radius and dim light for an additional 30 feet. At the end of each of its turns, the target repeats the saving throw. It takes 4d6 fire damage on a failed save, and the spell ends on a successful one. These magical flames can't be extinguished by nonmagical means.\" + \"\\n   \" + \"If damage from this spell kills a target, the target is turned to ash.\"\n\t}",
    "investiture of flame]": "{\n\t\tname : \"Investiture of Flame\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"warlock\", \"wizard\"],\n\t\tsource : [[\"X\", 159], [\"E\", 19]],\n\t\tlevel : 6,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"Self\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Conc, 10 min\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"Fire immune; Cold res.; 1d10 Fire dmg in 5 ft; 1 a 15-ft long 5-ft wide all crea 4d8 Fire dmg, save half\",\n\t\tdescriptionFull : \"Flames race across your body, shedding bright light in a 30-foot radius and dim light for an additional 30 feet for the spell's duration. The flames don't harm you. Until the spell ends, you gain the following benefits.\" + \"\\n \" + \"\\u2022 You are immune to fire damage and have resistance to cold damage.\" + \"\\n \" + \"\\u2022 Any creature that moves within 5 feet of you for the first time on a turn or ends its turn there takes 1d10 fire damage.\" + \"\\n \" + \"\\u2022 You can use your action to create a line of fire 15 feet long and 5 feet wide extending from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 4d8 fire damage on a failed save, or half as much damage on a successful one.\"\n\t}",
    "investiture of ice]": "{\n\t\tname : \"Investiture of Ice\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"warlock\", \"wizard\"],\n\t\tsource : [[\"X\", 159], [\"E\", 19]],\n\t\tlevel : 6,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"Self\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Conc, 10 min\",\n\t\tsave : \"Con\",\n\t\tdescription : \"Cold immune; Fire resist; 10-ft rad dif. ter.; 1 a 15-ft cone all crea 4d6 Cold dmg, half speed, save half\",\n\t\tdescriptionFull : \"Until the spell ends, ice rimes your body, and you gain the following benefits.\" + \"\\n \" + \"\\u2022 You are immune to cold damage and have resistance to fire damage.\" + \"\\n \" + \"\\u2022 You can move across difficult terrain created by ice or snow without spending extra movement.\" + \"\\n \" + \"\\u2022 The ground in a 10-foot radius around you is icy and is difficult terrain for creatures other than you. The radius moves with you.\" + \"\\n \" + \"\\u2022 You can use your action to create a 15-foot cone of freezing wind extending from your outstretched hand in a direction you choose. Each creature in the cone must make a Constitution saving throw. A creature takes 4d6 cold damage on a failed save, or half as much damage on a successful one. A creature that fails its save against this effect has its speed halved until the start of your next turn.\"\n\t}",
    "investiture of stone]": "{\n\t\tname : \"Investiture of Stone\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"warlock\", \"wizard\"],\n\t\tsource : [[\"X\", 159], [\"E\", 19]],\n\t\tlevel : 6,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"Self\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Conc, 10 min\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"Nonmagical Bludg/Pierc/Slash resist.; 1 a 15-ft rad all crea save or prone; move through earth/stone\",\n\t\tdescriptionFull : \"Until the spell ends, bits of rock spread across your body, and you gain the following benefits:\" + \"\\n \\u2022 \" + \"You have resistance to bludgeoning, piercing, and slashing damage from nonmagical attacks.\" + \"\\n \\u2022 \" + \"You can use your action to create a small earthquake on the ground in a 15-foot radius centered on you. Other creatures on that ground must succeed on a Dexterity saving throw or be knocked prone.\" + \"\\n \\u2022 \" + \"You can move across difficult terrain made of earth or stone without spending extra movement. You can move through solid earth or stone as if it was air and without destabilizing it, but you can't end your movement there. If you do so, you are ejected to the nearest unoccupied space, this spell ends, and you are stunned until the end of your next turn.\"\n\t}",
    "investiture of wind]": "{\n\t\tname : \"Investiture of Wind\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"warlock\", \"wizard\"],\n\t\tsource : [[\"X\", 160], [\"E\", 20]],\n\t\tlevel : 6,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"Self\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Conc, 10 min\",\n\t\tsave : \"Con\",\n\t\tdescription : \"Rngd wea atks dis. vs. you; fly 60 ft; 1 a 15-ft cube in 60 ft all 2d10 Bludg. dmg, push 10 ft, save half\",\n\t\tdescriptionFull : \"Until the spell ends, wind whirls around you, and you gain the following benefits.\" + \"\\n \" + \"\\u2022 Ranged weapon attacks made against you have disadvantage on the attack roll.\" + \"\\n \" + \"\\u2022 You gain a flying speed of 60 feet. If you are still flying when the spell ends, you fall, unless you can somehow prevent it.\" + \"\\n \" + \"\\u2022 You can use your action to create a 15-foot cube of swirling wind centered on a point you can see within 60 feet of you. Each creature in that area must make a Constitution saving throw. A creature takes 2d10 bludgeoning damage on a failed save, or half as much damage on a successful one. If a Large or smaller creature fails the save, that creature is also pushed up to 10 feet away from the center of the cube.\"\n\t}",
    "maelstrom]": "{\n\t\tname : \"Maelstrom\",\n\t\tclasses : [\"druid\"],\n\t\tsource : [[\"X\", 160], [\"E\", 20]],\n\t\tlevel : 5,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"120 ft\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"Paper or leaf in the shape of a funnel\",\n\t\tduration : \"Conc, 1 min\",\n\t\tsave : \"Str\",\n\t\tdescription : \"5-ft deep 30-ft rad dif. ter.; all crea starting turn in save or 6d6 Bludg. dmg and pulled 10 ft to center\",\n\t\tdescriptionFull : \"A mass of 5-foot-deep water appears and swirls in a 30-foot radius centered on a point you can see within range. The point must be on ground or in a body of water. Until the spell ends, that area is difficult terrain, and any creature that starts its turn there must succeed on a Strength saving throw or take 6d6 bludgeoning damage and be pulled 10 feet toward the center.\"\n\t}",
    "magic stone]": "{\n\t\tname : \"Magic Stone\",\n\t\tclasses : [\"druid\", \"warlock\"],\n\t\tsource : [[\"X\", 160], [\"E\", 20]],\n\t\tlevel : 0,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 bns\",\n\t\trange : \"Touch\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"1 min\",\n\t\tdescription : \"Imbue 3 pebbles for spell attacks, thrown 60 ft or with sling, do 1d6+spellcasting mod Bludg. dmg\",\n\t\tdescriptionFull : \"You touch one to three pebbles and imbue them with magic. You or someone else can make a ranged spell attack with one of the pebbles by throwing it or hurling it with a sling. If thrown, it has a range of 60 feet. If someone else attacks with the pebble, that attacker adds your spellcasting ability modifier, not the attacker's, to the attack roll. On a hit, the target takes bludgeoning damage equal to 1d6 + your spellcasting ability modifier. Hit or miss, the spell then ends on the stone.\" + \"\\n   \" + \"If you cast this spell again, the spell ends early on any pebbles still affected by it.\"\n\t}",
    "maximilian's earthen grasp]": "{\n\t\tname : \"Maximilian's Earthen Grasp\",\n\t\tnameShort : \"Max's Earthen Grasp\",\n\t\tnameAlt : \"Earthen Grasp\",\n\t\tclasses : [\"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 161], [\"E\", 20]],\n\t\tlevel : 2,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"30 ft\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"A miniature hand sculpted from clay\",\n\t\tduration : \"Conc, 1 min\",\n\t\tsave : \"Str\",\n\t\tdescription : \"Medium hand atks 1 crea: save or 2d6 Bludg. dmg \\u0026 restrained; 1 a hand moves/atks, releases; see B\",\n\t\tdescriptionFull : \"You choose a 5-foot-square unoccupied space on the ground that you can see within range. A Medium hand made from compacted soil rises there and reaches for one creature you can see within 5 feet of it. The target must make a Strength saving throw. On a failed save, the target takes 2d6 bludgeoning damage and is restrained for the spell's duration.\" + \"\\n   \" + \"As an action, you can cause the hand to crush the restrained target, which must make a Strength saving throw. The target takes 2d6 bludgeoning damage on a failed save, or half as much damage on a successful one.\" + \"\\n   \" + \"To break out, the restrained target can use its action to make a Strength check against your spell save DC. On a success, the target escapes and is no longer restrained by the hand.\" + \"\\n   \" + \"As an action, you can cause the hand to reach for a different creature or to move to a different unoccupied space within range. The hand releases a restrained target if you do either.\"\n\t}",
    "melf's minute meteors]": "{\n\t\tname : \"Melf's Minute Meteors\",\n\t\tnameAlt : \"Minute Meteors\",\n\t\tclasses : [\"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 161], [\"E\", 20]],\n\t\tlevel : 3,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"Self\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"Niter, sulfur, and pine tar formed into a bead\",\n\t\tduration : \"Conc, 10 min\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"6+2/SL meteors; at casting/bns a send up to two 120 ft for 5-ft rad all crea 2d6 Fire dmg; save half\",\n\t\tdescriptionFull : \"You create six tiny meteors in your space. They float in the air and orbit you for the spell's duration. When you cast the spell-and as a bonus action on each of your turns thereafter-you can expend one or two of the meteors, sending them streaking toward a point or points you choose within 120 feet of you. Once a meteor reaches its destination or impacts against a solid surface, the meteor explodes. Each creature within 5 feet of the point where the meteor explodes must make a Dexterity saving throw. A creature takes 2d6 fire damage on a failed save, or half as much damage on a successful one.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 4th level or higher, the number of meteors created increases by two for each slot level above 3rd.\"\n\t}",
    "mold earth]": "{\n\t\tname : \"Mold Earth\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 162], [\"E\", 21]],\n\t\tlevel : 0,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"30 ft\",\n\t\tcomponents : \"S\",\n\t\tduration : \"Instant. or 1 h\",\n\t\tdescription : \"5 cu ft earth; instant.: excavate; 1h: change to difficult or normal terrain, or change shape and color\",\n\t\tdescriptionFull : \"You choose a portion of dirt or stone that you can see within range and that fits within a 5-foot cube. You manipulate it in one of the following ways.\" + \"\\n \" + \"\\u2022 If you target an area of loose earth, you can instantaneously excavate it, move it along the ground, and deposit it up to 5 feet away. This movement doesn't have enough force to cause damage.\" + \"\\n \" + \"\\u2022 You cause shapes, colors, or both to appear on the dirt or stone, spelling out words, creating images, or shaping patterns. The changes last for 1 hour.\" + \"\\n \" + \"\\u2022 If the dirt or stone you target is on the ground, you cause it to become difficult terrain. Alternatively, you can cause the ground to become normal terrain if it is already difficult terrain. This change lasts for 1 hour.\" + \"\\n\\n\" + \"If you cast this spell multiple times, you can have no more than two of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.\"\n\t}",
    "primordial ward]": "{\n\t\tname : \"Primordial Ward\",\n\t\tclasses : [\"druid\"],\n\t\tsource : [[\"X\", 163], [\"E\", 21]],\n\t\tlevel : 6,\n\t\tschool : \"Abjur\",\n\t\ttime : \"1 a\",\n\t\trange : \"Self\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Conc, 1 min\",\n\t\tdescription : \"Acid, Cold, Fire, Lightning, and Thunder resistance; use rea to gain 1 immunity for 1 rnd, spell ends\",\n\t\tdescriptionFull : \"You have resistance to acid, cold, fire, lightning, and thunder damage for the spell's duration.\" + \"\\n   \" + \"When you take damage of one of those types, you can use your reaction to gain immunity to that type of damage, including against the triggering damage. If you do so, the resistances end, and you have the immunity until the end of your next turn, at which time the spell ends.\"\n\t}",
    "pyrotechnics]": "{\n\t\tname : \"Pyrotechnics\",\n\t\tclasses : [\"bard\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 163], [\"E\", 21]],\n\t\tlevel : 2,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"60 ft\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Con\",\n\t\tdescription : \"5 cu ft nonma. flame extinguish, or 10-ft rad all crea save or blind 1 rnd, or 20-ft rad hvy obsc. 1 min\",\n\t\tdescriptionFull : \"Choose an area of nonmagical flame that you can see and that fits within a 5-foot cube within range. You can extinguish the fire in that area, and you create either fireworks or smoke when you do so.\" + \"\\n   \" + toUni(\"Fireworks\") + \": The target explodes with a dazzling display of colors. Each creature within 10 feet of the target must succeed on a Constitution saving throw or become blinded until the end of your next turn.\" + \"\\n   \" + toUni(\"Smoke\") + \": Thick black smoke spreads out from the target in a 20-foot radius, moving around corners. The area of the smoke is heavily obscured. The smoke persists for 1 minute or until a strong wind disperses it.\"\n\t}",
    "shape water]": "{\n\t\tname : \"Shape Water\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 164], [\"E\", 21]],\n\t\tlevel : 0,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"30 ft\",\n\t\tcomponents : \"S\",\n\t\tduration : \"Instant. or 1 h\",\n\t\tdescription : \"5 cu ft water; instant: move/change flow; 1h: simple shapes/change color or opacity/freeze\",\n\t\tdescriptionFull : \"You choose an area of water that you can see within range and that fits within a 5-foot cube. You manipulate it in one of the following ways.\" + \"\\n \" + \"\\u2022 You instantaneously move or otherwise change the flow of the water as you direct, up to 5 feet in any direction. This movement doesn't have enough force to cause damage.\" + \"\\n \" + \"\\u2022 You cause the water to form into simple shapes and animate at your direction. This change lasts for 1 hour.\" + \"\\n \" + \"\\u2022 You change the water's color or opacity. The water must be changed in the same way throughout. This change lasts for 1 hour.\" + \"\\n \" + \"\\u2022 You freeze the water, provided that there are no creatures in it. The water unfreezes in 1 hour.\" + \"\\n\\n\" + \"If you cast this spell multiple times, you can have no more than two of its non-instantaneous effects active at a time, and you can dismiss such an effect as an action.\"\n\t}",
    "skywrite]": "{\n\t\tname : \"Skywrite\",\n\t\tclasses : [\"bard\", \"druid\", \"wizard\"],\n\t\tsource : [[\"X\", 165], [\"E\", 22]],\n\t\tritual : true,\n\t\tlevel : 2,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"Sight\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Conc, 1 h\",\n\t\tdescription : \"Write up to 10 words with clouds in a part of the sky you can see; strong wind can diperse the clouds\",\n\t\tdescriptionFull : \"You cause up to ten words to form in a part of the sky you can see. The words appear to be made of cloud and remain in place for the spell's duration. The words dissipate when the spell ends. A strong wind can disperse the clouds and end the spell early.\"\n\t}",
    "snilloc's snowball swarm]": "{\n\t\tname : \"Snilloc's Snowball Swarm\",\n\t\tnameAlt : \"Snowball Swarm\",\n\t\tclasses : [\"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 165], [\"E\", 22]],\n\t\tlevel : 2,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"90 ft\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"A piece of ice or a small white rock chip\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"5-ft radius all creatures 3d6+1d6/SL Cold damage; save halves\",\n\t\tdescriptionFull : \"A flurry of magic snowballs erupts from a point you choose within range. Each creature in a 5-foot-radius sphere centered on that point must make a Dexterity saving throw. A creature takes 3d6 cold damage on a failed save, or half as much damage on a successful one.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.\"\n\t}",
    "storm sphere]": "{\n\t\tname : \"Storm Sphere\",\n\t\tclasses : [\"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 166], [\"E\", 22]],\n\t\tlevel : 4,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"150 ft\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Conc, 1 min\",\n\t\tsave : \"Str\",\n\t\tdescription : \"20-ft rad dif. ter.; all crea + end turn save or 2d6+1d6/SL Bludg.; bns a 60 ft spell atk 4d6 Lightning\",\n\t\tdescriptionFull : \"A 20-foot-radius sphere of whirling air springs into existence centered on a point you choose within range. The sphere remains for the spell's duration. Each creature in the sphere when it appears or that ends its turn there must succeed on a Strength saving throw or take 2d6 bludgeoning damage. The sphere's space is difficult terrain.\" + \"\\n   \" + \"Until the spell ends, you can use a bonus action on each of your turns to cause a bolt of lightning to leap from the center of the sphere toward one creature you choose within 60 feet of the center. Make a ranged spell attack. You have advantage on the attack roll if the target is in the sphere. On a hit, the target takes 4d6 lightning damage.\" + \"\\n   \" + \"Creatures within 30 feet of the sphere have disadvantage on Wisdom (Perception) checks made to listen.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 5th level or higher, the damage increases for each of its effects by 1d6 for each slot level above 4th.\"\n\t}",
    "thunderclap]": "{\n\t\tname : \"Thunderclap\",\n\t\tclasses : [\"bard\", \"druid\", \"sorcerer\", \"warlock\", \"wizard\"],\n\t\tsource : [[\"X\", 168], [\"E\", 22]],\n\t\tlevel : 0,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"5 ft\",\n\t\tcomponents : \"S\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Con\",\n\t\tdescription : \"100-ft rad audible; all crea but you in area save or 1d6 Thunder dmg; +1d6 at CL 5, 11, and 17\",\n\t\tdescriptionFull : \"You create a burst of thunderous sound that can be heard up to 100 feet away. Each creature within range, other than you, must succeed on a Constitution saving throw or take 1d6 thunder damage.\" + \"\\n   \" + \"The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).\"\n\t}",
    "tidal wave]": "{\n\t\tname : \"Tidal Wave\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 168], [\"E\", 22]],\n\t\tlevel : 3,\n\t\tschool : \"Conj\",\n\t\ttime : \"1 a\",\n\t\trange : \"120 ft\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"A drop of water\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"30-ft x 10-ft, 10-ft high all crea 4d8 Bludg. dmg and prone; save halves not prone; extinguish flames\",\n\t\tdescriptionFull : \"You conjure up a wave of water that crashes down on an area within range. The area can be up to 30 feet long, up to 10 feet wide, and up to 10 feet tall. Each creature in that area must make a Dexterity saving throw. On a failed save, a creature takes 4d8 bludgeoning damage and is knocked prone. On a successful save, a creature takes half as much damage and isn't knocked prone. The water then spreads out across the ground in all directions, extinguishing unprotected flames in its area and within 30 feet of it, and then it vanishes.\"\n\t}",
    "transmute rock]": "{\n\t\tname : \"Transmute Rock\",\n\t\tclasses : [\"druid\", \"wizard\"],\n\t\tsource : [[\"X\", 169], [\"E\", 22]],\n\t\tlevel : 5,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"120 ft\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"Clay and water\",\n\t\tduration : \"Until dispelled\",\n\t\tdescription : \"40 cu ft stone to mud or mud to stone; mud and stone restrains; mud from ceiling falls; see book\",\n\t\tdescriptionFull : \"You choose an area of stone or mud that you can see that fits within a 40-foot cube and is within range, and choose one of the following effects.\" + \"\\n   \" + toUni(\"Transmute Rock to Mud\") + \": Nonmagical rock of any sort in the area becomes an equal volume of thick, flowing mud that remains for the spell's duration.\" + \"\\n   \" + \"The ground in the spell's area becomes muddy enough that creatures can sink into it. Each foot that a creature moves through the mud costs 4 feet of movement, and any creature on the ground when you cast the spell must make a Strength saving throw. A creature must also make the saving throw when it moves into the area for the first time on a turn or ends its turn there. On a failed save, a creature sinks into the mud and is restrained, though it can use an action to end the restrained condition on itself by pulling itself free of the mud.\" + \"\\n   \" + \"If you cast the spell on a ceiling, the mud falls. Any creature under the mud when it falls must make a Dexterity saving throw. A creature takes 4d8 bludgeoning damage on a failed save, or half as much damage on a successful one.\" + \"\\n   \" + toUni(\"Transmute Mud to Rock\") + \": Nonmagical mud or quicksand in the area no more than 10 feet deep transforms into soft stone for the spell's duration. Any creature in the mud when it transforms must make a Dexterity saving throw. On a successful save, a creature is shunted safely to the surface in an unoccupied space. On a failed save, a creature becomes restrained by the rock. A restrained creature, or another creature within reach, can use an action to try to break the rock by succeeding on a DC 20 Strength check or by dealing damage to it. The rock has AC 15 and 25 hit points, and it is immune to poison and psychic damage.\"\n\t}",
    "vitriolic sphere]": "{\n\t\tname : \"Vitriolic Sphere\",\n\t\tclasses : [\"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 170], [\"E\", 23]],\n\t\tlevel : 4,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"150 ft\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"A drop of giant slug bile\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"20-ft rad all crea 10d4+2d4/SL now and 5d4 Acid dmg at end next turn; save half \\u0026 no dmg next rnd\",\n\t\tdescriptionFull : \"You point at a location within range, and a glowing, 1-foot-diameter ball of emerald acid streaks there and explodes in a 20-foot-radius sphere. Each creature in that area must make a Dexterity saving throw. On a failed save, a creature takes 10d4 acid damage and another 5d4 acid damage at the end of its next turn. On a successful save, a creature takes half the initial damage and no damage at the end of its next turn.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 5th level or higher, the initial damage increases by 2d4 for each slot level above 4th.\"\n\t}",
    "wall of sand]": "{\n\t\tname : \"Wall of Sand\",\n\t\tclasses : [\"wizard\"],\n\t\tsource : [[\"X\", 170], [\"E\", 23]],\n\t\tlevel : 3,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"90 ft\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"A handful of sand\",\n\t\tduration : \"Conc, 10 min\",\n\t\tdescription : \"30\\u00D710\\u00D710ft (l\\u00D7w\\u00D7h) wall on the ground; blocks line of sight; blinded while inside; 1/3 move\",\n\t\tdescriptionMetric : \"9\\u00D73\\u00D73m (l\\u00D7w\\u00D7h) wall on the ground; blocks line of sight; blinded while inside; 1/3 move\",\n\t\tdescriptionFull : \"You conjure up a wall of swirling sand on the ground at a point you can see within range. You can make the wall up to 30 feet long, 10 feet high, and 10 feet thick, and it vanishes when the spell ends. It blocks line of sight but not movement. A creature is blinded while in the wall's space and must spend 3 feet of movement for every 1 foot it moves there.\"\n\t}",
    "wall of water]": "{\n\t\tname : \"Wall of Water\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 170], [\"E\", 23]],\n\t\tlevel : 3,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"60 ft\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"A drop of water\",\n\t\tduration : \"Conc, 10 min\",\n\t\tdescription : \"30\\u00D71\\u00D710ft (l\\u00D7w\\u00D7h) or 20-ft rad 20-ft high; dif. ter.; range wea dis.; Fire dmg half; Cold dmg freezes\",\n\t\tdescriptionMetric : \"9\\u00D70,3\\u00D73m (l\\u00D7w\\u00D7h) or 6-m rad 6-m high; dif. ter.; ranged wea dis.; Fire dmg half; Cold dmg freezes\",\n\t\tdescriptionFull : \"You conjure up a wall of water on the ground at a point you can see within range. You can make the wall up to 30 feet long, 10 feet high, and 1 foot thick, or you can make a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall vanishes when the spell ends. The wall's space is difficult terrain.\" + \"\\n   \" + \"Any ranged weapon attack that enters the wall's space has disadvantage on the attack roll, and fire damage is halved if the fire effect passes through the wall to reach its target. Spells that deal cold damage that pass through the wall cause the area of the wall they pass through to freeze solid (at least a 5-foot square section is frozen). Each 5-foot-square frozen section has AC 5 and 15 hit points. Reducing a frozen section to 0 hit points destroys it. When a section is destroyed, the wall's water doesn't fill it.\"\n\t}",
    "warding wind]": "{\n\t\tname : \"Warding Wind\",\n\t\tclasses : [\"bard\", \"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 170], [\"E\", 23]],\n\t\tlevel : 2,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"10-ft rad\",\n\t\tcomponents : \"V\",\n\t\tduration : \"Conc, 10 min\",\n\t\tdescription : \"Strong (20 mph) wind in area deafens/extinguishes unprotected flames/dif. ter./ranged wea have dis\",\n\t\tdescriptionFull : \"A strong wind (20 miles per hour) blows around you in a 10-foot radius and moves with you, remaining centered on you. The wind lasts for the spell's duration.\" + \"\\n   \" + \"The wind has the following effects.\" + \"\\n \" + \"\\u2022 It deafens you and other creatures in its area.\" + \"\\n \" + \"\\u2022 It extinguishes unprotected flames in its area that are torch-sized or smaller.\" + \"\\n \" + \"\\u2022 The area is difficult terrain for creatures other than you.\" + \"\\n \" + \"\\u2022 The attack rolls of ranged weapon attacks have disadvantage if they pass in or out of the wind.\" + \"\\n \" + \"\\u2022 It hedges out vapor, gas, and fog that can be dispersed by strong wind.\"\n\t}",
    "watery sphere]": "{\n\t\tname : \"Watery Sphere\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 170], [\"E\", 23]],\n\t\tlevel : 4,\n\t\tschool : \"Conj\",\n\t\ttime : \"1 a\",\n\t\trange : \"90 ft\",\n\t\tcomponents : \"V,S,M\",\n\t\tcompMaterial : \"A droplet of water\",\n\t\tduration : \"Conc, 1 min\",\n\t\tsave : \"Str\",\n\t\tdescription : \"5-ft rad all crea < Huge save or restrained; on save ejected; save each rnd; 1 a move sphere 30 ft\",\n\t\tdescriptionFull : \"You conjure up a sphere of water with a 5-foot radius at a point you can see within range. The sphere can hover but no more than 10 feet off the ground. The sphere remains for the spell's duration.\" + \"\\n   \" + \"Any creature in the sphere's space must make a Strength saving throw. On a successful save, a creature is ejected from that space to the nearest unoccupied space of the creature's choice outside the sphere. A Huge or larger creature succeeds on the saving throw automatically, and a Large or smaller creature can choose to fail it. On a failed save, a creature is restrained by the sphere and is engulfed by the water. At the end of each of its turns, a restrained target can repeat the saving throw, ending the effect on itself on a success.\" + \"\\n   \" + \"The sphere can restrain as many as four Medium or smaller creatures or one Large creature. If the sphere restrains a creature that causes it to exceed this capacity, a random creature that was already restrained by the sphere falls out of it and lands prone in a space within 5 feet of it.\" + \"\\n   \" + \"As an action, you can move the sphere up to 30 feet in a straight line. If it moves over a pit, a cliff, or other drop-off, it safely descends until it is hovering 10 feet above the ground. Any creature restrained by the sphere moves with it. You can ram the sphere into creatures, forcing them to make the saving throw.\" + \"\\n   \" + \"When the spell ends, the sphere falls to the ground and extinguishes all normal flames within 30 feet of it. Any creature restrained by the sphere is knocked prone in the space where it falls. The water then vanishes.\"\n\t}",
    "whirlwind]": "{\n\t\tname : \"Whirlwind\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 171], [\"E\", 24]],\n\t\tlevel : 7,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"300 ft\",\n\t\tcomponents : \"V,M\",\n\t\tcompMaterial : \"A piece of straw\",\n\t\tduration : \"Conc, 1 min\",\n\t\tsave : \"Dex\",\n\t\tdescription : \"10-ft rad 30-ft high all crea 10d6 Bludg. dmg; save halves; restrains; 1 a move 30 ft; see book\",\n\t\tdescriptionFull : \"A whirlwind howls down to a point that you can see on the ground within range. The whirlwind is a 10-foot-radius, 30-foot-high cylinder centered on that point. Until the spell ends, you can use your action to move the whirlwind up to 30 feet in any direction along the ground. The whirlwind sucks up any Medium or smaller objects that aren't secured to anything and that aren't worn or carried by anyone.\" + \"\\n   \" + \"A creature must make a Dexterity saving throw the first time on a turn that it enters the whirlwind or that the whirlwind enters its space, including when the whirlwind first appears. A creature takes 10d6 bludgeoning damage on a failed save, or half as much damage on a successful one. In addition, a Large or smaller creature that fails the save must succeed on a Strength saving throw or become restrained in the whirlwind until the spell ends. When a creature starts its turn restrained by the whirlwind, the creature is pulled 5 feet higher inside it, unless the creature is at the top. A restrained creature moves with the whirlwind and falls when the spell ends, unless the creature has some means to stay aloft.\" + \"\\n   \" + \"A restrained creature can use an action to make a Strength or Dexterity check against your spell save DC. If successful, the creature is no longer restrained by the whirlwind and is hurled 3d6 \\u00D7 10 feet away from it in a random direction.\"\n\t}",
    "booming blade]": "{\n\tname : \"Booming Blade\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"S\", 142],\n\tlevel : 0,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"5 ft\",\n\tcomponents : \"V,M\",\n\tcompMaterial : \"A weapon\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Melee wea atk with cast; if hit, it 0d8, if it moves next rnd it 1d8 Thunder dmg; +1d8 at CL5, 11, \\u0026 17\",\n\tdescriptionFull : \"As part of the action used to cast this spell, you must make a melee attack with a weapon against one creature within the spell's range, otherwise the spell fails. On a hit, the target suffers the attack's normal effects, and it becomes sheathed in booming energy until the start of your next turn. If the target willingly moves before then, it immediately takes 1d8 thunder damage, and the spell ends.\" + AtHigherLevels + \"This spell's damage increases when you reach higher levels. At 5th level, the melee attack deals an extra 1d8 thunder damage to the target, and the damage the target takes for moving increases to 2d8. Both damage rolls increase by 1d8 at 11th level and 17th level.\"\n}",
    "green-flame blade]": "{\n\tname : \"Green-Flame Blade\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"S\", 143],\n\tlevel : 0,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"5 ft\",\n\tcomponents : \"V,M\",\n\tcompMaterial : \"A weapon\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Melee wea atk with cast; if hit, it 0d8, crea in 5 ft 0d8+spell mod Fire dmg; +1d8 at CL 5, 11, and 17\",\n\tdescriptionFull : \"As part of the action used to cast this spell, you must make a melee attack with a weapon against one creature within the spell's range, otherwise the spell fails. On a hit, the target suffers the attack's normal effects, and green fire leaps from the target to a different creature of your choice that you can see within 5 feet of it. The second creature takes fire damage equal to your spellcasting ability modifier.\" + \"\\n   \" + \"This spell's damage increases when you reach higher levels. At 5th level, the melee attack deals an extra 1d8 fire damage to the target, and the fire damage to the second creature increases to 1d8 + your spellcasting ability modifier. Both damage rolls increase by 1d8 at 11th level and 17th level.\"\n}",
    "lightning lure]": "{\n\tname : \"Lightning Lure\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"S\", 143],\n\tlevel : 0,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"15 ft\",\n\tcomponents : \"V\",\n\tduration : \"Instantaneous\",\n\tsave : \"Str\",\n\tdescription : \"1 crea you see save or pull 10 ft to you; if end in 5 ft, 1d8 Lightning dmg; +1d8 at CL 5, 11, and 17\",\n\tdescriptionFull : \"You create a lash of lightning energy that strikes at one creature of your choice that you can see within range. The target must succeed on a Strength saving throw or be pulled up to 10 feet in a straight line toward you and then take 1d8 lightning damage if it is within 5 feet of you.\" + \"\\n   \" + \"This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).\"\n}",
    "sword burst]": "{\n\tname : \"Sword Burst\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"S\", 143],\n\tlevel : 0,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"5 ft\",\n\tcomponents : \"V\",\n\tduration : \"Instantaneous\",\n\tsave : \"Dex\",\n\tdescription : \"All crea in range save or 1d6 Force damage; +1d6 at CL 5, 11, and 17\",\n\tdescriptionFull : \"You create a momentary circle of spectral blades that sweep around you. Each creature within range, other than you, must succeed on a Dexterity saving throw or take 1d6 force damage.\" + \"\\n   \" + \"This spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).\"\n}",
    "catnap]": "{\n\tname : \"Catnap\",\n\tclasses : [\"bard\", \"sorcerer\", \"wizard\"],\n\tsource : [\"X\", 151],\n\tritual : false,\n\tlevel : 3,\n\tschool : \"Ench\",\n\ttime : \"1 a\",\n\trange : \"30 ft\",\n\tcomponents : \"S,M\",\n\tcompMaterial : \"A pinch of sand\",\n\tduration : \"10 min\",\n\tdescription : \"3+1/SL willing crea unconscious for 10 min to gain benefits of short rest; Ends if dmg or 1 a to wake\",\n\tdescriptionFull : \"You make a calming gesture, and up to three willing creatures of your choice that you can see within range fall unconscious for the spell's duration. The spell ends on a target early if it takes damage or someone uses an action to shake or slap it awake. If a target remains unconscious for the full duration, that target gains the benefit of a short rest, and it can't be affected by this spell again until it finishes a long rest.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 4th level or higher, you can target one additional willing creature for each slot level above 3rd.\"\n}",
    "cause fear-xgte]": "{\n\tname : \"Cause Fear\",\n\tclasses : [\"warlock\", \"wizard\"],\n\tsource : [\"X\", 151],\n\tritual : false,\n\tlevel : 1,\n\tschool : \"Necro\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Wis\",\n\tdescription : \"1+1/SL crea (not construct/undead), each max 30 ft apart, save or frightened; save end of each turn\",\n\tdescriptionFull : \"You awaken the sense of mortality in one creature you can see within range. A construct or an undead is immune to this effect. The target must succeed on a Wisdom saving throw or become frightened of you until the spell ends. The frightened target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.\"\n}",
    "ceremony-xgte]": "{\n\tname : \"Ceremony\",\n\tclasses : [\"cleric\", \"paladin\"],\n\tsource : [\"X\", 151],\n\tritual : true,\n\tlevel : 1,\n\tschool : \"Abjur\",\n\ttime : \"1 h\",\n\trange : \"Touch\",\n\tcomponents : \"V,S,M\\u2020\",\n\tcompMaterial : \"25 gp worth of powdered silver, which the spell consumes\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Perform religious ceremony on target(s) within 10 ft throughout the casting; see book (25gp cons.)\",\n\tdescriptionFull : \"You perform a special religious ceremony that is infused with magic. When you cast the spell, choose one of the following rites, the target of which must be within 10 feet of you throughout the casting.\" + \"\\n   \" + toUni(\"Atonement\") + \": You touch one willing creature whose alignment has changed, and you make a DC 20 Wisdom (Insight) check. On a successful check, you restore the target to its original alignment.\" + \"\\n   \" + toUni(\"Bless Water\") + \": You touch one vial of water and cause it to become holy water.\" + \"\\n   \" + toUni(\"Coming of Age\") + \": You touch one humanoid who is a young adult. For the next 24 hours, whenever the target makes an ability check, it can roll a d4 and add the number rolled to the ability check. A creature can benefit from this rite only once.\" + \"\\n   \" + toUni(\"Dedication\") + \": You touch one humanoid who wishes to be dedicated to your god's service. For the next 24 hours, whenever the target makes a saving throw, it can roll a d4 and add the number rolled to the save. A creature can benefit from this rite only once.\" + \"\\n   \" + toUni(\"Funeral Rite\") + \": You touch one corpse, and for the next 7 days, the target can't become undead by any means short of a wish spell.\" + \"\\n   \" + toUni(\"Wedding\") + \": You touch adult humanoids willing to be bonded together in marriage. For the next 7 days, each target gains a +2 bonus to AC while they are within 30 feet of each other. A creature can benefit from this rite again only if widowed.\"\n}",
    "chaos bolt-xgte]": "{\n\t\tname : \"Chaos Bolt\",\n\t\tclasses : [\"sorcerer\"],\n\t\tsource : [[\"X\", 151], [\"G\", 67]],\n\t\tritual : false,\n\t\tlevel : 1,\n\t\tschool : \"Evoc\",\n\t\ttime : \"1 a\",\n\t\trange : \"120 ft\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Instantaneous\",\n\t\tdescription : \"Spell atk 2d8+1d6+1d6/SL dmg, d8s set dmg type, see B; double on d8s: new atk vs. crea in 30 ft\",\n\t\tdescriptionFull : \"You hurl an undulating, warbling mass of chaotic energy at one creature in range. Make a ranged spell attack against the target. On a hit, the target takes 2d8 + 1d6 damage. Choose one of the d8s. The number rolled on that die determines the attack's damage type, as shown below.\" + \"\\n\\n\" + toUni(\"d8\") + \"\\t\" + toUni(\"Damage Type\") + \"\\n  1\\tAcid\" + \"\\n  2\\tCold\" + \"\\n  3\\tFire\" + \"\\n  4\\tForce\" + \"\\n  5\\tLightning\" + \"\\n  6\\tPoison\" + \"\\n  7\\tPsychic\" + \"\\n  8\\tThunder\" + \"\\n\\n   \" + \"If you roll the same number on both d8s, the chaotic energy leaps from the target to a different creature of your choice within 30 feet of it. Make a new attack roll against the new target, and make a new damage roll, which could cause the chaotic energy to leap again.\" + \"\\n   \" + \"A creature can be targeted only once by each casting of this spell.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 2nd level or higher, each target takes 1d6 extra damage of the type rolled for each slot level above 1st.\"\n\t}",
    "charm monster]": "{\n\tname : \"Charm Monster\",\n\tclasses : [\"bard\", \"druid\", \"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 151],\n\tritual : false,\n\tlevel : 4,\n\tschool : \"Ench\",\n\ttime : \"1 a\",\n\trange : \"30 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"1 h\",\n\tsave : \"Wis\",\n\tdescription : \"1+1/SL creatures, each max 30 ft apart, save or charmed; adv. on save if you/allies are fighting it\",\n\tdescriptionFull : \"You attempt to charm a creature you can see within range. It must make a Wisdom saving throw, and it does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature is friendly to you. When the spell ends, the creature knows it was charmed by you.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 5th level or higher, you can target one additional creature for each slot level above 4th. The creatures must be within 30 feet of each other when you target them.\"\n}",
    "create homunculus]": "{\n\tname : \"Create Homunculus\",\n\tclasses : [\"wizard\"],\n\tsource : [\"X\", 152],\n\tritual : false,\n\tlevel : 6,\n\tschool : \"Trans\",\n\ttime : \"1 h\",\n\trange : \"Touch\",\n\tcomponents : \"V,S,M\\u0192\",\n\tcompMaterial : \"Clay, ash, and mandrake root, all of which the spell consumes, and a jewel-encrusted dagger worth at least 1,000 gp\", \n\tduration : \"Instantaneous\",\n\tdescription : \"You take 2d4 piercing dmg to create a homunculus as your faithful companion; see book (1000gp)\",\n\tdescriptionFull : \"While speaking an intricate incantation, you cut yourself with a jewel-encrusted dagger, taking 2d4 piercing damage that can't be reduced in any way. You then drip your blood on the spell's other components and touch them, transforming them into a special construct called a homunculus.\" + \"\\n   \" + \"The statistics of the homunculus are in the Monster Manual. It is your faithful companion, and it dies if you die. Whenever you finish a long rest, you can spend up to half your Hit Dice if the homunculus is on the same plane of existence as you. When you do so, roll each die and add your Constitution modifier to it. Your hit point maximum is reduced by the total, and the homunculus's hit point maximum and current hit points are both increased by it. This process can reduce you to no lower than 1 hit point, and the change to your and the homunculus's hit points ends when you finish your next long rest. The reduction to your hit point maximum can't be removed by any means before then, except by the homunculus's death.\" + \"\\n   \" + \"You can have only one homunculus at a time. If you cast this spell while your homunculus lives, the spell fails.\"\n}",
    "crown of stars]": "{\n\tname : \"Crown of Stars\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 152],\n\tritual : false,\n\tlevel : 7,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"Self\",\n\tcomponents : \"V,S\",\n\tduration : \"1 h\",\n\tdescription : \"7+2/SL motes shed 30-ft light; bonus action to fire one as 120 ft ranged atk for 4d12 Radiant dmg\",\n\tdescriptionFull : \"Seven star-like motes of light appear and orbit your head until the spell ends. You can use a bonus action to send one of the motes streaking toward one creature or object within 120 feet of you. When you do so, make a ranged spell attack. On a hit, the target takes 4d12 radiant damage. Whether you hit or miss, the mote is expended. The spell ends early if you expend the last mote.\" + \"\\n   \" + \"If you have four or more motes remaining, they shed bright light in a 30-foot radius and dim light for an additional 30 feet. If you have one to three motes remaining, they shed dim light in a 30-foot radius.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 8th level or higher, the number of motes created increases by two for each slot level above 7th.\"\n}",
    "danse macabre]": "{\n\tname : \"Danse Macabre\",\n\tclasses : [\"warlock\", \"wizard\"],\n\tsource : [\"X\", 153],\n\tritual : false,\n\tlevel : 5,\n\tschool : \"Necro\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"5+2/SL small/medium corpses as zombie/skeleton; spellc. mod to atk/dmg; bns a command in 60 ft\",\n\tdescriptionFull : \"Threads of dark power leap from your fingers to pierce up to five Small or Medium corpses you can see within range. Each corpse immediately stands up and becomes undead. You decide whether it is a zombie or a skeleton (the statistics for zombies and skeletons are in the Monster Manual), and it gains a bonus to its attack and damage rolls equal to your spellcasting ability modifier.\" + \"\\n   \" + \"You can use a bonus action to mentally command the creatures you make with this spell, issuing the same command to all of them. To receive the command, a creature must be within 60 feet of you. You decide what action the creatures will take and where they will move during their next turn, or you can issue a general command, such as to guard a chamber or passageway against your foes. If you issue no commands, the creatures do nothing except defend themselves against hostile creatures. Once given an order, the creatures continue to follow it until their task is complete.\" + \"\\n   \" + \"The creatures are under your control until the spell ends, after which they become inanimate once more\" + AtHigherLevels + \"When you cast this spell using a spell slot of 6th level or higher, you animate up to two additional corpses for each slot level above 5th.\"\n}",
    "dawn]": "{\n\tname : \"Dawn\",\n\tclasses : [\"cleric\", \"wizard\"],\n\tsource : [\"X\", 153],\n\tritual : false,\n\tlevel : 5,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S,M\\u0192\",\n\tcompMaterial : \"A sunburst pendant worth at least 100 gp\", \n\tduration : \"Conc, 1 min\",\n\tsave : \"Con\",\n\tdescription : \"30-ft rad 40-ft high all crea 4d10 Radiant dmg when cast or end turn in; bns a move it 60 ft (100gp)\",\n\tdescriptionFull : \"The light of dawn shines down on a location you specify within range. Until the spell ends, a 30-foot-radius, 40-foot-high cylinder of bright light glimmers there. This light is sunlight.\" + \"\\n   \" + \"When the cylinder appears, each creature in it must make a Constitution saving throw, taking 4d10 radiant damage on a failed save, or half as much damage on a successful one. A creature must also make this saving throw whenever it ends its turn in the cylinder.\" + \"\\n   \" + \"If you're within 60 feet of the cylinder, you can move it up to 60 feet as a bonus action on your turn.\"\n}",
    "dragon's breath]": "{\n\tname : \"Dragon's Breath\",\n\tclasses : [\"sorcerer\", \"wizard\"],\n\tsource : [\"X\", 154],\n\tritual : false,\n\tlevel : 2,\n\tschool : \"Trans\",\n\ttime : \"1 bns\",\n\trange : \"Touch\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A hot pepper\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Dex\",\n\tdescription : \"1 willing crea: 1 act to breathe 15-ft cone 3d6+1d6/SL Acid/Cold/Fire/Light./Poison dmg; save half\",\n\tdescriptionFull : \"You touch one willing creature and imbue it with the power to spew magical energy from its mouth, provided it has one. Choose acid, cold, fire, lightning, or poison. Until the spell ends, the creature can use an action to exhale energy of the chosen type in a 15-foot cone. Each creature in that area must make a Dexterity saving throw, taking 3d6 damage of the chosen type on a failed save, or half as much damage on a successful one.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.\"\n}",
    "druid grove]": "{\n\tname : \"Druid Grove\",\n\tclasses : [\"druid\"],\n\tsource : [\"X\", 154],\n\tritual : false,\n\tlevel : 6,\n\tschool : \"Abjur\",\n\ttime : \"10 min\",\n\trange : \"Touch\",\n\tcomponents : \"V,S,M\\u2020\",\n\tcompMaterial : \"Mistletoe, which the spell consumes, that was harvested with a golden sickle under the light of a full moon\",\n\tduration : \"24 h\",\n\tdescription : \"Protect 30-ft to 90-ft cube outdoors or underground; see book for effects\",\n\tdescriptionFull : \"You invoke the spirits of nature to protect an area outdoors or underground. The area can be as small as a 30-foot cube or as large as a 90-foot cube. Buildings and other structures are excluded from the affected area. If you cast this spell in the same area every day for a year, the spell lasts until dispelled.\" + \"\\n   \" + \"The spell creates the following effects within the area. When you cast this spell, you can specify creatures as friends who are immune to the effects. You can also specify a password that, when spoken aloud, makes the speaker immune to these effects.\" + \"\\n   \" + \"The entire warded area radiates magic. A dispel magic cast on the area, if successful, removes only one of the following effects, not the entire area. That spell's caster chooses which effect to end. Only when all its effects are gone is this spell dispelled.\" + \"\\n   \" + toUni(\"Solid Fog\") + \": You can fill any number of 5-foot squares on the ground with thick fog, making them heavily obscured. The fog reaches 10 feet high. In addition, every foot of movement through the fog costs 2 extra feet. To a creature immune to this effect, the fog obscures nothing and looks like soft mist, with motes of green light floating in the air.\" + \"\\n   \" + toUni(\"Grasping Undergrowth\") + \": You can fill any number of 5-foot squares on the ground that aren't filled with fog with grasping weeds and vines, as if they were affected by an entangle spell. To a creature immune to this effect, the weeds and vines feel soft and reshape themselves to serve as temporary seats or beds.\" + \"\\n   \" + toUni(\"Grove Guardians\") + \": You can animate up to four trees in the area, causing them to uproot themselves from the ground. These trees have the same statistics as an awakened tree, which appears in the Monster Manual, except they can't speak, and their bark is covered with druidic symbols. If any creature not immune to this effect enters the warded area, the grove guardians fight until they have driven off or slain the intruders. The grove guardians also obey your spoken commands (no action required by you) that you issue while in the area. If you don't give them commands and no intruders are present, the grove guardians do nothing. The grove guardians can't leave the warded area. When the spell ends, the magic animating them disappears, and the trees take root again if possible.\" + \"\\n   \" + toUni(\"Additional Spell Effects\") + \": You can place your choice of one of the following magical effects within the warded area:\" + \"\\n \\u2022 \" + \"A constant gust of wind in two locations of your choice\" + \"\\n \\u2022 \" + \"Spike growth in one location of your choice\" + \"\\n \\u2022 \" + \"Wind wall in two locations of your choice\" + \"\\n   \" + \"To a creature immune to this effect, the winds are a fragrant, gentle breeze, and the area of spike growth is harmless.\"\n}",
    "enemies abound]": "{\n\tname : \"Enemies Abound\",\n\tclasses : [\"bard\", \"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 155],\n\tritual : false,\n\tlevel : 3,\n\tschool : \"Ench\",\n\ttime : \"1 a\",\n\trange : \"120 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Int\",\n\tdescription : \"1 crea save or regard all creatures it can see as enemies, random targeting; save when damaged to end\",\n\tdescriptionFull : \"You reach into the mind of one creature you can see and force it to make an Intelligence saving throw. A creature automatically succeeds if it is immune to being frightened. On a failed save, the target loses the ability to distinguish friend from foe, regarding all creatures it can see as enemies until the spell ends. Each time the target takes damage, it can repeat the saving throw, ending the effect on itself on a success.\" + \"\\n   \" + \"Whenever the affected creature chooses another creature as a target, it must choose the target at random from among the creatures it can see within range of the attack, spell, or other ability it's using. If an enemy provokes an opportunity attack from the affected creature, the creature must make that attack if it is able to.\"\n}",
    "enervation]": "{\n\tname : \"Enervation\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 155],\n\tritual : false,\n\tlevel : 5,\n\tschool : \"Necro\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Dex\",\n\tdescription : \"1 crea 4d8+1d8/SL Necro dmg, action to repeat, I heal half; on save 2d8+1d8/SL dmg once; see book\",\n\tdescriptionFull : \"A tendril of inky darkness reaches out from you, touching a creature you can see within range to drain life from it. The target must make a Dexterity saving throw. On a successful save, the target takes 2d8 necrotic damage, and the spell ends. On a failed save, the target takes 4d8 necrotic damage, and until the spell ends, you can use your action on each of your turns to automatically deal 4d8 necrotic damage to the target. The spell ends if you use your action to do anything else, if the target is ever outside the spell's range, or if the target has total cover from you.\" + \"\\n   \" + \"Whenever the spell deals damage to a target, you regain hit points equal to half the amount of necrotic damage the target takes.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d8 for each slot level above 5th.\"\n}",
    "far step]": "{\n\tname : \"Far Step\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 155],\n\tritual : false,\n\tlevel : 5,\n\tschool : \"Conj\",\n\ttime : \"1 bns\",\n\trange : \"Self\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"At casting and as bonus action for duration, you can teleport 60 ft to a space you can see\",\n\tdescriptionFull : \"You teleport up to 60 feet to an unoccupied space you can see. On each of your turns before the spell ends, you can use a bonus action to teleport in this way again.\"\n}",
    "find greater steed]": "{\n\tname : \"Find Greater Steed\",\n\t\tclasses : [\"paladin\"],\n\t\tsource : [\"X\", 156],\n\t\tlevel : 4,\n\t\tschool : \"Conj\",\n\t\ttime : \"10 min\",\n\t\trange : \"30 ft\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Instantaneous\",\n\t\tdescription : \"Gain the services of a steed; can communicate with it telepathically; can share spells with it; see book\",\n\t\tdescriptionFull : \"You summon a spirit that assumes the form of a loyal, majestic mount. Appearing in an unoccupied space within range, the spirit takes on a form you choose: a griffon, a pegasus, a peryton, a dire wolf, a rhinoceros, or a saber-toothed tiger. The creature has the statistics provided in the Monster Manual for the chosen form, though it is a celestial, a fey, or a fiend (your choice) instead of its normal creature type. Additionally, if it has an Intelligence score of 5 or lower, its Intelligence becomes 6, and it gains the ability to understand one language of your choice that you speak.\" + \"\\n   \" + \"You control the mount in combat. While the mount is within 1 mile of you, you can communicate with it telepathically. While mounted on it, you can make any spell you cast that targets only you also target the mount.\" + \"\\n   \" + \"The mount disappears temporarily when it drops to 0 hit points or when you dismiss it as an action. Casting this spell again re-summons the bonded mount, with all its hit points restored and any conditions removed.\" + \"\\n   \" + \"You can't have more than one mount bonded by this spell or find steed at the same time. As an action, you can release a mount from its bond, causing it to disappear permanently.\" + \"\\n   \" + \"Whenever the mount disappears, it leaves behind any objects it was wearing or carrying.\"\n}",
    "guardian of nature]": "{\n\tname : \"Guardian of Nature\",\n\tclasses : [\"druid\", \"ranger\"],\n\tsource : [\"X\", 157],\n\tritual : false,\n\tlevel : 4,\n\tschool : \"Trans\",\n\ttime : \"1 bns\",\n\trange : \"Self\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"You transform into a Primal Beast (offensive bonuses) or a Great Tree (defensive bonuses); see book\",\n\tdescriptionFull : \"A nature spirit answers your call and transforms you into a powerful guardian. The transformation lasts until the spell ends. You choose one of the following forms to assume: Primal Beast or Great Tree.\" + \"\\n\\n\" + toUni(\"Primal Beast\") + \": Bestial fur covers your body, your facial features become feral, and you gain the following benefits:\" + \"\\n \\u2022 \" + \"Your walking speed increases by 10 feet.\" + \"\\n \\u2022 \" + \"You gain darkvision with a range of 120 feet.\" + \"\\n \\u2022 \" + \"You make Strength-based attack rolls with advantage.\" + \"\\n \\u2022 \" + \"Your melee weapon attacks deal an extra 1d6 force damage on a hit.\" + \"\\n\\n\" + toUni(\"Great Tree\") + \": Your skin appears barky, leaves sprout from your hair, and you gain the following benefits:\" + \"\\n \\u2022 \" + \"You gain 10 temporary hit points.\" + \"\\n \\u2022 \" + \"You make Constitution saving throws with advantage.\" + \"\\n \\u2022 \" + \"You make Dexterity- and Wisdom-based attack rolls with advantage.\" + \"\\n \\u2022 \" + \"While you are on the ground, the ground within 15 feet of you is difficult terrain for your enemies.\"\n}",
    "healing spirit]": "{\n\tname : \"Healing Spirit\",\n\tclasses : [\"druid\", \"ranger\"],\n\tsource : [\"X\", 157],\n\tritual : false,\n\tlevel : 2,\n\tschool : \"Conj\",\n\ttime : \"1 bns\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"5-ft cube heals any crea I can see that enter it for 1d6+1d6/SL HP; I can move it 30 ft as a bns action\",\n\tdescriptionFull : \"You call forth a nature spirit to soothe the wounded. The intangible spirit appears in a space that is a 5-foot cube you can see within range. The spirit looks like a transparent beast or fey (your choice).\" + \"\\n   \" + \"Until the spell ends, whenever you or a creature you can see moves into the spirit's space for the first time on a turn or starts its turn there, you can cause the spirit to restore 1d6 hit points to that creature (no action required). The spirit can't heal constructs or undead.\" + \"\\n   \" + \"As a bonus action on your turn, you can move the spirit up to 30 feet to a space you can see.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 3rd level or higher, the healing increases by 1d6 for each slot level above 2nd.\"\n}",
    "holy weapon]": "{ \n\tname : \"Holy Weapon\",\n\tclasses : [\"cleric\", \"paladin\"],\n\tsource : [\"X\", 157],\n\tritual : false,\n\tlevel : 5,\n\tschool : \"Evoc\",\n\ttime : \"1 bns\",\n\trange : \"Touch\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 h\",\n\tsave : \"Con\",\n\tdescription : \"Wea +2d8 Radiant dmg; bns a end spell, 30-ft rad all crea 4d8 Radiant dmg, blind; save half, no blind\",\n\tdescriptionFull : \"You imbue a weapon you touch with holy power. Until the spell ends, the weapon emits bright light in a 30-foot radius and dim light for an additional 30 feet. In addition, weapon attacks made with it deal an extra 2d8 radiant damage on a hit. If the weapon isn't already a magic weapon, it becomes one for the duration.\" + \"\\n   \" + \"As a bonus action on your turn, you can dismiss this spell and cause the weapon to emit a burst of radiance. Each creature of your choice that you can see within 30 feet of you must make a Constitution saving throw. On a failed save, a creature takes 4d8 radiant damage, and it is blinded for 1 minute. On a successful save, a creature takes half as much damage and isn't blinded. At the end of each of its turns, a blinded creature can make a Constitution saving throw, ending the effect on itself on a success.\"\n}",
    "illusory dragon]": "{\n\tname : \"Illusory Dragon\",\n\tclasses : [\"wizard\"],\n\tsource : [\"X\", 157],\n\tritual : false,\n\tlevel : 8,\n\tschool : \"Illus\",\n\ttime : \"1 a\",\n\trange : \"120 ft\",\n\tcomponents : \"S\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"W/I\",\n\tdescription : \"Huge shadowy dragon; see: Wis save or fright.; bns a move 60 ft \\u0026 breath wea 7d6 dmg; Int save half\",\n\tdescriptionFull : \"By gathering threads of shadow material from the Shadowfell, you create a Huge shadowy dragon in an unoccupied space that you can see within range. The illusion lasts for the spell's duration and occupies its space, as if it were a creature.\" + \"\\n   \" + \"When the illusion appears, any of your enemies that can see it must succeed on a Wisdom saving throw or become frightened of it for 1 minute. If a frightened creature ends its turn in a location where it doesn't have line of sight to the illusion, it can repeat the saving throw, ending the effect on itself on a success.\" + \"\\n   \" + \"As a bonus action on your turn, you can move the illusion up to 60 feet. At any point during its movement, you can cause it to exhale a blast of energy in a 60-foot cone originating from its space. When you create the dragon, choose a damage type: acid, cold, fire, lightning, necrotic, or poison. Each creature in the cone must make an Intelligence saving throw, taking 7d6 damage of the chosen damage type on a failed save, or half as much damage on a successful one.\" + \"\\n   \" + \"The illusion is tangible because of the shadow stuff used to create it, but attacks miss it automatically, it succeeds on all saving throws, and it is immune to all damage and conditions. A creature that uses an action to examine the dragon can determine that it is an illusion by succeeding on an Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through it and has advantage on saving throws against its breath.\"\n}",
    "infernal calling]": "{\n\tname : \"Infernal Calling\",\n\tclasses : [\"warlock\", \"wizard\"],\n\tsource : [\"X\", 158],\n\tritual : false,\n\tlevel : 5,\n\tschool : \"Conj\",\n\ttime : \"1 min\",\n\trange : \"90 ft\",\n\tcomponents : \"V,S,M\\u0192\",\n\tcompMaterial : \"A ruby worth at least 999 gp\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"Summon 1 devil of CR 6+1/SL; hostile to all, obeys your command if to its liking or Cha check; see B\",\n\tdescriptionFull : \"Uttering a dark incantation, you summon a devil from the Nine Hells. You choose the devil's type, which must be one of challenge rating 6 or lower, such as a barbed devil or a bearded devil. The devil appears in an unoccupied space that you can see within range. The devil disappears when it drops to 0 hit points or when the spell ends.\" + \"\\n   \" + \"The devil is unfriendly toward you and your companions. Roll initiative for the devil, which has its own turns. It is under the Dungeon Master's control and acts according to its nature on each of its turns, which might result in its attacking you if it thinks it can prevail, or trying to tempt you to undertake an evil act in exchange for limited service. The DM has the creature's statistics.\" + \"\\n   \" + \"On each of your turns, you can try to issue a verbal command to the devil (no action required by you). It obeys the command if the likely outcome is in accordance with its desires, especially if the result would draw you toward evil. Otherwise, you must make a Charisma (Deception, Intimidation, or Persuasion) check contested by its Wisdom (Insight) check. You make the check with advantage if you say the devil's true name. If your check fails, the devil becomes immune to your verbal commands for the duration of the spell, though it can still carry out your commands if it chooses. If your check succeeds, the devil carries out your command — such as “attack my enemies,” “explore the room ahead,” or “bear this message to the queen” — until it completes the activity, at which point it returns to you to report having done so.\" + \"\\n   \" + \"If your concentration ends before the spell reaches its full duration, the devil doesn't disappear if it has become immune to your verbal commands. Instead, it acts in whatever manner it chooses for 3d6 minutes, and then it disappears.\" + \"\\n   \" + \"If you possess an individual devil's talisman, you can summon that devil if it is of the appropriate challenge rating plus 1, and it obeys all your commands, with no Charisma checks required.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 6th level or higher, the challenge rating increases by 1 for each slot level above 5th.\"\n}",
    "infestation-xgte]": "{\n\tname : \"Infestation\",\n\tclasses : [\"druid\", \"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 158],\n\tritual : false,\n\tlevel : 0,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"30 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A living flea\",\n\tduration : \"Instantaneous\",\n\tsave : \"Con\",\n\tdescription : \"1 crea save or 1d6 Poison dmg and moved 5 ft in random direction; +1d6 at CL 5, 11, and 17\",\n\tdescriptionFull : \"You cause a cloud of mites, fleas, and other parasites to appear momentarily on one creature you can see within range. The target must succeed on a Constitution saving throw, or it takes 1d6 poison damage and moves 5 feet in a random direction if it can move and its speed is at least 5 feet. Roll a d4 for the direction:\" + \"\\n\\n\" + toUni(\"d4\") + \"\\t\" + toUni(\"Direction\") + \"\\n  1\\tNorth\" + \"\\n  2\\tSouth\" + \"\\n  3\\tEast\" + \"\\n  4\\tWest\" + \"\\n\\n   \" + \"This movement doesn't provoke opportunity attacks, and if the direction rolled is blocked, the target doesn't move.\" + \"\\n   \" + \"The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).\"\n}",
    "invulnerability]": "{\n\tname : \"Invulnerability\",\n\tclasses : [\"wizard\"],\n\tsource : [\"X\", 160],\n\tritual : false,\n\tlevel : 9,\n\tschool : \"Abjur\",\n\ttime : \"1 a\",\n\trange : \"Self\",\n\tcomponents : \"V,S,M\\u2020\",\n\tcompMaterial : \"A small piece of adamantine worth at least 500 gp, which the spell consumes\",\n\tduration : \"Conc, 10 min\",\n\tdescription : \"Immune to all damage until the spell ends (500gp cons.)\",\n\tdescriptionFull : \"You are immune to all damage until the spell ends.\"\n}",
    "life transference]": "{\n\tname : \"Life Transference\",\n\tclasses : [\"cleric\", \"wizard\"],\n\tsource : [\"X\", 160],\n\tritual : false,\n\tlevel : 3,\n\tschool : \"Necro\",\n\ttime : \"1 a\",\n\trange : \"30 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Instantaneous\",\n\tdescription : \"You take 4d8+1d8/SL Necrotic dmg, and 1 crea in range you can see regains HP twice that amount\",\n\tdescriptionFull : \"You sacrifice some of your health to mend another creature's injuries. You take 4d8 necrotic damage, and one creature of your choice that you can see within range regains a number of hit points equal to twice the necrotic damage you take.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.\"\n}",
    "maddening darkness]": "{\n\tname : \"Maddening Darkness\",\n\tclasses : [\"warlock\", \"wizard\"],\n\tsource : [\"X\", 160],\n\tritual : false,\n\tlevel : 8,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"150 ft\",\n\tcomponents : \"V,M\",\n\tcompMaterial : \"A drop of pitch mixed with a drop of mercury\",\n\tduration : \"Conc, 10 min\",\n\tsave : \"Wis\",\n\tdescription : \"60-ft rad darkness; darkvision, light doesn't work; Crea starting turn in 8d8 Psychic dmg, save halves\",\n\tdescriptionFull : \"Magical darkness spreads from a point you choose within range to fill a 60-foot-radius sphere until the spell ends. The darkness spreads around corners. A creature with darkvision can't see through this darkness. Nonmagical light, as well as light created by spells of 8th level or lower, can't illuminate the area.\" + \"\\n   \" + \"Shrieks, gibbering, and mad laughter can be heard within the sphere. Whenever a creature starts its turn in the sphere, it must make a Wisdom saving throw, taking 8d8 psychic damage on a failed save, or half as much damage on a successful one.\"\n}",
    "mass polymorph]": "{\n\tname : \"Mass Polymorph\",\n\tclasses : [\"bard\", \"sorcerer\", \"wizard\"],\n\tsource : [\"X\", 160],\n\tritual : false,\n\tlevel : 9,\n\tschool : \"Trans\",\n\ttime : \"1 a\",\n\trange : \"120 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A caterpillar cocoon\",\n\tduration : \"Conc, 1 h\",\n\tsave : \"Wis\",\n\tdescription : \"10 crea save or take chosen beast form of CR \\u2264 its CR or half its char. level; can only act as beast; see B\",\n\tdescriptionFull : \"You transform up to ten creatures of your choice that you can see within range. An unwilling target must succeed on a Wisdom saving throw to resist the transformation. An unwilling shapechanger automatically succeeds on the save.\" + \"\\n   \" + \"Each target assumes a beast form of your choice, and you can choose the same form or different ones for each target. The new form can be any beast you have seen whose challenge rating is equal to or less than the target's (or half the target's level, if the target doesn't have a challenge rating). The target's game statistics, including mental ability scores, are replaced by the statistics of the chosen beast, but the target retains its hit points, alignment, and personality.\" + \"\\n   \" + \"Each target gains a number of temporary hit points equal to the hit points of its new form. These temporary hit points can't be replaced by temporary hit points from another source. A target reverts to its normal form when it has no more temporary hit points or it dies. If the spell ends before then, the creature loses all its temporary hit points and reverts to its normal form.\" + \"\\n   \" + \"The creature is limited in the actions it can perform by the nature of its new form. It can't speak, cast spells, or do anything else that requires hands or speech.\" + \"\\n   \" + \"The target's gear melds into the new form. The target can't activate, use, wield, or otherwise benefit from any of its equipment.\"\n}",
    "mental prison]": "{\n\tname : \"Mental Prison\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 161],\n\tritual : false,\n\tlevel : 6,\n\tschool : \"Illus\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"S\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Int\",\n\tdescription : \"1 crea 5d10 Psychic dmg; save or restrained, blind, deaf, and takes 10d10 dmg if moved; charm effect\",\n\tdescriptionFull : \"You attempt to bind a creature within an illusory cell that only it perceives. One creature you can see within range must make an Intelligence saving throw. The target succeeds automatically if it is immune to being charmed. On a successful save, the target takes 5d10 psychic damage, and the spell ends. On a failed save, the target takes 5d10 psychic damage, and you make the area immediately around the target's space appear dangerous to it in some way. You might cause the target to perceive itself as being surrounded by fire, floating razors, or hideous maws filled with dripping teeth. Whatever form the illusion takes, the target can't see or hear anything beyond it and is restrained for the spell's duration. If the target is moved out of the illusion, makes a melee attack through it, or reaches any part of its body through it, the target takes 10d10 psychic damage, and the spell ends.\"\n}",
    "mighty fortress]": "{\n\tname : \"Mighty Fortress\",\n\tclasses : [\"wizard\"],\n\tsource : [\"X\", 161],\n\tritual : false,\n\tlevel : 8,\n\tschool : \"Conj\",\n\ttime : \"1 min\",\n\trange : \"1 mile\",\n\tcomponents : \"V,S,M\\u2020\",\n\tcompMaterial : \"A diamond worth at least 500 gp, which the spell consumes\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Create a stone fortress 120 ft on a side for 7 days; see book for effects (500gp cons.)\",\n\tdescriptionFull : \"A fortress of stone erupts from a square area of ground of your choice that you can see within range. The area is 120 feet on each side, and it must not have any buildings or other structures on it. Any creatures in the area are harmlessly lifted up as the fortress rises.\" + \"\\n   \" + \"The fortress has four turrets with square bases, each one 20 feet on a side and 30 feet tall, with one turret on each corner. The turrets are connected to each other by stone walls that are each 80 feet long, creating an enclosed area. Each wall is 1 foot thick and is composed of panels that are 10 feet wide and 20 feet tall. Each panel is contiguous with two other panels or one other panel and a turret. You can place up to four stone doors in the fortress's outer wall.\" + \"\\n   \" + \"A small keep stands inside the enclosed area. The keep has a square base that is 50 feet on each side, and it has three floors with 10-foot-high ceilings. Each of the floors can be divided into as many rooms as you like, provided each room is at least 5 feet on each side. The floors of the keep are connected by stone staircases, its walls are 6 inches thick, and interior rooms can have stone doors or open archways as you choose. The keep is furnished and decorated however you like, and it contains sufficient food to serve a nine-course banquet for up to 100 people each day. Furnishings, food, and other objects created by this spell crumble to dust if removed from the fortress.\" + \"\\n   \" + \"A staff of one hundred invisible servants obeys any command given to them by creatures you designate when you cast the spell. Each servant functions as if created by the unseen servant spell.\" + \"\\n   \" + \"The walls, turrets, and keep are all made of stone that can be damaged. Each 10-foot-by-10-foot section of stone has AC 15 and 30 hit points per inch of thickness. It is immune to poison and psychic damage. Reducing a section of stone to 0 hit points destroys it and might cause connected sections to buckle and collapse at the DM's discretion.\" + \"\\n   \" + \"After 7 days or when you cast this spell somewhere else, the fortress harmlessly crumbles and sinks back into the ground, leaving any creatures that were inside it safely on the ground.\" + \"\\n   \" + \"Casting this spell on the same spot once every 7 days for a year makes the fortress permanent.\"\n}",
    "mind spike]": "{ // +1d8 at higher levels errata (https://twitter.com/JeremyECrawford/status/930603935391293440)\n\tname : \"Mind Spike\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 162],\n\tritual : false,\n\tlevel : 2,\n\tschool : \"Div\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"S\",\n\tduration : \"Conc, 1 h\",\n\tsave: \"Wis\",\n\tdescription : \"1 crea 3d8+1d8/SL Psychic dmg, know its location, can't be invis for you; save half, no other benefits\",\n\tdescriptionFull : \"You reach into the mind of one creature you can see within range. The target must make a Wisdom saving throw, taking 3d8 psychic damage on a failed save, or half as much damage on a successful one. On a failed save, you also always know the target's location until the spell ends, but only while the two of you are on the same plane of existence. While you have this knowledge, the target can't become hidden from you, and if it's invisible, it gains no benefit from that condition against you.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.\"\n}",
    "negative energy flood]": "{\n\tname : \"Negative Energy Flood\",\n\tclasses : [\"warlock\", \"wizard\"],\n\tsource : [\"X\", 163],\n\tritual : false,\n\tlevel : 5,\n\tschool : \"Necro\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,M\",\n\tcompMaterial : \"A broken bone and a square of black silk\",\n\tduration : \"Instantaneous\",\n\tsave : \"Con\",\n\tdescription : \"1 non-undead 5d12 Necrotic dmg; save halves; rises as zombie if killed; undead gain 5d12/2 temp HP\",\n\tdescriptionFull : \"You send ribbons of negative energy at one creature you can see within range. Unless the target is undead, it must make a Constitution saving throw, taking 5d12 necrotic damage on a failed save, or half as much damage on a successful one. A target killed by this damage rises up as a zombie at the start of your next turn. The zombie pursues whatever creature it can see that is closest to it. Statistics for the zombie are in the Monster Manual.\" + \"\\n   \" + \"If you target an undead with this spell, the target doesn't make a saving throw. Instead, roll 5d12. The target gains half the total as temporary hit points.\"\n}",
    "power word pain]": "{\n\tname : \"Power Word Pain\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 163],\n\tritual : false,\n\tlevel : 7,\n\tschool : \"Ench\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V\",\n\tduration : \"Instantaneous\",\n\tdescription : \"1 crea with 100 HP or less disadv. atk/check/save, conc. save to cast; save/rnd to end; charm effect\",\n\tdescriptionFull : \"You speak a word of power that causes waves of intense pain to assail one creature you can see within range. If the target has 100 hit points or fewer, it is subject to crippling pain. Otherwise, the spell has no effect on it. A target is also unaffected if it is immune to being charmed.\" + \"\\n   \" + \"While the target is affected by crippling pain, any speed it has can be no higher than 10 feet. The target also has disadvantage on attack rolls, ability checks, and saving throws, other than Constitution saving throws. Finally, if the target tries to cast a spell, it must first succeed on a Constitution saving throw, or the casting fails and the spell is wasted.\" + \"\\n   \" + \"A target suffering this pain can make a Constitution saving throw at the end of each of its turns. On a successful save, the pain ends.\"\n}",
    "primal savagery-xgte]": "{ \n\tname : \"Primal Savagery\",\n\tclasses : [\"druid\"],\n\tsource : [\"X\", 163],\n\tritual : false,\n\tlevel : 0,\n\tschool : \"Trans\",\n\ttime : \"1 a\",\n\trange : \"Self\",\n\tcomponents : \"S\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Melee spell attack, 5 ft range, for 1d10 Acid dmg; +1d10 at CL 5, 11, and 17\",\n\tdescriptionFull : \"You channel primal magic to cause your teeth or fingernails to sharpen, ready to deliver a corrosive attack. Make a melee spell attack against one creature within 5 feet of you. On a hit, the target takes 1d10 acid damage. After you make the attack, your teeth or fingernails return to normal.\" + \"\\n   \" + \"The spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).\"\n}",
    "psychic scream]": "{\n\tname : \"Psychic Scream\",\n\tclasses : [\"bard\", \"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 163],\n\tritual : false,\n\tlevel : 9,\n\tschool : \"Ench\",\n\ttime : \"1 a\",\n\trange : \"90 ft\",\n\tcomponents : \"S\",\n\tduration : \"Instantaneous\",\n\tsave : \"Int\",\n\tdescription : \"10 crea Int>2 save or 14d6 Psychic dmg and stunned; save halves, no stun; end of turn save to stop\",\n\tdescriptionFull : \"You unleash the power of your mind to blast the intellect of up to ten creatures of your choice that you can see within range. Creatures that have an Intelligence score of 2 or lower are unaffected.\" + \"\\n   \" + \"Each target must make an Intelligence saving throw. On a failed save, a target takes 14d6 psychic damage and is stunned. On a successful save, a target takes half as much damage and isn't stunned. If a target is killed by this damage, its head explodes, assuming it has one.\" + \"\\n   \" + \"A stunned target can make an Intelligence saving throw at the end of each of its turns. On a successful save, the stunning effect ends.\"\n}",
    "scatter]": "{\n\tname : \"Scatter\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 164],\n\tritual : false,\n\tlevel : 6,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"30 ft\",\n\tcomponents : \"V\",\n\tduration : \"Instantaneous\",\n\tsave : \"Wis\",\n\tdescription : \"Up to 5 creatures in range, save or teleported 120 ft to a different space you can see on the ground\",\n\tdescriptionFull : \"The air quivers around up to five creatures of your choice that you can see within range. An unwilling creature must succeed on a Wisdom saving throw to resist this spell. You teleport each affected target to an unoccupied space that you can see within 120 feet of you. That space must be on the ground or on a floor.\"\n}",
    "shadow blade]": "{\n\tname : \"Shadow Blade\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 164],\n\tritual : false,\n\tlevel : 2,\n\tschool : \"Illus\",\n\ttime : \"1 bns\",\n\trange : \"Self\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"Sword 2d8 Psychic dmg, finesse, light, thrown (20/60ft), adv. if target in dim/dark; +1d8 at SL3/5/7\",\n\tdescriptionMetric : \"Sword: 2d8 Psychic dmg, finesse, light, thrown (6/18m), adv. if target in dim/dark; +1d8 at SL3/5/7\",\n\tdescriptionFull : \"You weave together threads of shadow to create a sword of solidified gloom in your hand. This magic sword lasts until the spell ends. It counts as a simple melee weapon with which you are proficient. It deals 2d8 psychic damage on a hit and has the finesse, light, and thrown properties (range 20/60). In addition, when you use the sword to attack a target that is in dim light or darkness, you make the attack roll with advantage.\" + \"\\n   \" + \"If you drop the weapon or throw it, it dissipates at the end of the turn. Thereafter, while the spell persists, you can use a bonus action to cause the sword to reappear in your hand.\" + AtHigherLevels + \"When you cast this spell using a 3rd- or 4th-level spell slot, the damage increases to 3d8. When you cast it using a 5th- or 6th-level spell slot, the damage increases to 4d8. When you cast it using a spell slot of 7th level or higher, the damage increases to 5d8.\"\n}",
    "shadow of moil]": "{\n\tname : \"Shadow of Moil\",\n\tclasses : [\"warlock\"],\n\tsource : [\"X\", 164],\n\tritual : false,\n\tlevel : 4,\n\tschool : \"Necro\",\n\ttime : \"1 a\",\n\trange : \"Self\",\n\tcomponents : \"V,S,M\\u0192\",\n\tcompMaterial : \"An undead eyeball encased in a gem worth at least 150 gp\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"You: heavy obs., resist Radiant dmg; 10-ft rad: 1 step darker, hit vs. you take 2d8 Necro dmg (150gp)\",\n\tdescriptionFull : \"Flame-like shadows wreathe your body until the spell ends, causing you to become heavily obscured to others. The shadows turn dim light within 10 feet of you into darkness, and bright light in the same area to dim light.\" + \"\\n   \" + \"Until the spell ends, you have resistance to radiant damage. In addition, whenever a creature within 10 feet of you hits you with an attack, the shadows lash out at that creature, dealing it 2d8 necrotic damage.\"\n}",
    "sickening radiance]": "{\n\tname : \"Sickening Radiance\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 164],\n\tritual : false,\n\tlevel : 4,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"120 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 10 min\",\n\tsave : \"Con\",\n\tdescription : \"30-ft rad; all enter/start turn: save or 4d10 Radiant dmg, 1 level of exhaustion, and emit 5-ft rad light\",\n\tdescriptionFull : \"Dim, greenish light spreads within a 30-foot-radius sphere centered on a point you choose within range. The light spreads around corners, and it lasts until the spell ends.\" + \"\\n   \" + \"When a creature moves into the spell's area for the first time on a turn or starts its turn there, that creature must succeed on a Constitution saving throw or take 4d10 radiant damage, and it suffers one level of exhaustion and emits a dim, greenish light in a 5-foot radius. This light makes it impossible for the creature to benefit from being invisible. The light and any levels of exhaustion caused by this spell go away when the spell ends.\"\n}",
    "skill empowerment]": "{\n\tname : \"Skill Empowerment\",\n\tclasses : [\"bard\", \"sorcerer\", \"wizard\"],\n\tsource : [\"X\", 165],\n\tritual : false,\n\tlevel : 5,\n\tschool : \"Trans\",\n\ttime : \"1 a\",\n\trange : \"Touch\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"1 willing creature gains expertise in one skill of my choice that it is proficient with for the duration\",\n\tdescriptionFull : \"Your magic deepens a creature's understanding of its own talent. You touch one willing creature and give it expertise in one skill of your choice; until the spell ends, the creature doubles its proficiency bonus for ability checks it makes that use the chosen skill.\" + \"\\n   \" + \"You must choose a skill in which the target is proficient and that isn't already benefiting from an effect, such as Expertise, that doubles its proficiency bonus.\"\n}",
    "snare-xgte]": "{\n\tname : \"Snare\",\n\tclasses : [\"druid\", \"ranger\", \"wizard\"],\n\tsource : [\"X\", 165],\n\tritual : false,\n\tlevel : 1,\n\tschool : \"Abjur\",\n\ttime : \"1 min\",\n\trange : \"Touch\",\n\tcomponents : \"V,S,M\\u2020\",\n\tcompMaterial : \"25 feet of rope, which is consumed by the spell\",\n\tduration : \"8 h, till trigger\",\n\tsave : \"Dex\",\n\tdescription : \"5-ft rad trap; Investigation vs spell DC to see; save or restrained 3 ft in the air; save each rnd (5sp)\",\n\tdescriptionFull : \"As you cast this spell, you use the rope to create a circle with a 5-foot radius on the ground or the floor. When you finish casting, the rope disappears and the circle becomes a magic trap.\" + \"\\n   \" + \"This trap is nearly invisible, requiring a successful Intelligence (Investigation) check against your spell save DC to be discerned.\" + \"\\n   \" + \"The trap triggers when a Small, Medium, or Large creature moves onto the ground or the floor in the spell's radius. That creature must succeed on a Dexterity saving throw or be magically hoisted into the air, leaving it hanging upside down 3 feet above the ground or the floor. The creature is restrained there until the spell ends.\" + \"\\n   \" + \"A restrained creature can make a Dexterity saving throw at the end of each of its turns, ending the effect on itself on a success. Alternatively, the creature or someone else who can reach it can use an action to make an Intelligence (Arcana) check against your spell save DC. On a success, the restrained effect ends.\" + \"\\n   \" + \"After the trap is triggered, the spell ends when no creature is restrained by it.\"\n}",
    "soul cage]": "{\n\tname : \"Soul Cage\",\n\tclasses : [\"warlock\", \"wizard\"],\n\tsource : [\"X\", 165],\n\tritual : false,\n\tlevel : 6,\n\tschool : \"Necro\",\n\ttime : \"1 rea\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S,M\\u0192\",\n\tcompMaterial : \"A tiny silver cage worth 100 gp\",\n\tduration : \"8 h\",\n\tdescription : \"As a reaction when humanoid in range dies, you capture their soul in a tiny cage; see book (100gp)\",\n\tdescriptionFull : \"This spell snatches the soul of a humanoid as it dies and traps it inside the tiny cage you use for the material component. A stolen soul remains inside the cage until the spell ends or until you destroy the cage, which ends the spell. While you have a soul inside the cage, you can exploit it in any of the ways described below. You can use a trapped soul up to six times. Once you exploit a soul for the sixth time, it is released, and the spell ends. While a soul is trapped, the dead humanoid it came from can't be revived.\" + \"\\n   \" + toUni(\"Steal Life\") + \": You can use a bonus action to drain vigor from the soul and regain 2d8 hit points.\" + \"\\n   \" + toUni(\"Query Soul\") + \": You ask the soul a question (no action required) and receive a brief telepathic answer, which you can understand regardless of the language used. The soul knows only what it knew in life, but it must answer you truthfully and to the best of its ability. The answer is no more than a sentence or two and might be cryptic.\" + \"\\n   \" + toUni(\"Borrow Experience\") + \": You can use a bonus action to bolster yourself with the soul's life experience, making your next attack roll, ability check, or saving throw with advantage. If you don't use this benefit before the start of your next turn, it is lost.\" + \"\\n   \" + toUni(\"Eyes of the Dead\") + \": You can use an action to name a place the humanoid saw in life, which creates an invisible sensor somewhere in that place if it is on the plane of existence you're currently on. The sensor remains for as long as you concentrate, up to 10 minutes (as if you were concentrating on a spell). You receive visual and auditory information from the sensor as if you were in its space using your senses\" + \"\\n   \" + \"A creature that can see the sensor (such as one using see invisibility or truesight) sees a translucent image of the tormented humanoid whose soul you caged.\"\n}",
    "steel wind strike]": "{\n\tname : \"Steel Wind Strike\",\n\tclasses : [\"ranger\", \"wizard\"],\n\tsource : [\"X\", 166],\n\tritual : false,\n\tlevel : 5,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"30 ft\",\n\tcomponents : \"S,M\\u0192\",\n\tcompMaterial : \"A melee weapon worth at least 1 sp\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Melee spell attack vs. 5 crea in range; 6d10 Force dmg on hit; after, you teleport next to one target\",\n\tdescriptionFull : \"You flourish the weapon used in the casting and then vanish to strike like the wind. Choose up to five creatures you can see within range. Make a melee spell attack against each target. On a hit, a target takes 6d10 force damage.\" + \"\\n   \" + \"You can then teleport to an unoccupied space you can see within 5 feet of one of the targets you hit or missed.\"\n}",
    "summon greater demon]": "{\n\tname : \"Summon Greater Demon\",\n\tclasses : [\"warlock\", \"wizard\"],\n\tsource : [\"X\", 166],\n\tritual : false,\n\tlevel : 4,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A vial of blood from a humanoid killed within the past 24 hours\",\n\tduration : \"Conc, 1 h\",\n\tsave : \"Cha\",\n\tdescription : \"Summon 1 demon of CR 5+1/SL that obeys you; end of each of its turn, save to break free; see book\",\n\tdescriptionFull : \"You utter foul words, summoning one demon from the chaos of the Abyss. You choose the demon's type, which must be one of challenge rating 5 or lower, such as a shadow demon or a barlgura. The demon appears in an unoccupied space you can see within range, and the demon disappears when it drops to 0 hit points or when the spell ends.\" + \"\\n   \" + \"Roll initiative for the demon, which has its own turns. When you summon it and on each of your turns thereafter, you can issue a verbal command to it (requiring no action on your part), telling it what it must do on its next turn. If you issue no command, it spends its turn attacking any creature within reach that has attacked it.\" + \"\\n   \" + \"At the end of each of the demon's turns, it makes a Charisma saving throw. The demon has disadvantage on this saving throw if you say its true name. On a failed save, the demon continues to obey you. On a successful save, your control of the demon ends for the rest of the duration, and the demon spends its turns pursuing and attacking the nearest non-demons to the best of its ability. If you stop concentrating on the spell before it reaches its full duration, an uncontrolled demon doesn't disappear for 1d6 rounds if it still has hit points.\" + \"\\n   \" + \"As part of casting the spell, you can form a circle on the ground with the blood used as a material component. The circle is large enough to encompass your space. While the spell lasts, the summoned demon can't cross the circle or harm it, and it can't target anyone within it. Using the material component in this manner consumes it when the spell ends.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 5th level or higher, the challenge rating increases by 1 for each slot level above 4th.\"\n}",
    "summon lesser demons]": "{\n\tname : \"Summon Lesser Demons\",\n\tclasses : [\"warlock\", \"wizard\"],\n\tsource : [\"X\", 167],\n\tritual : false,\n\tlevel : 3,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A vial of blood from a humanoid killed within the past 24 hours\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"Summon up to 8 (16 at SL6, 24 at SL8) CR \\u22641 1 demons, DM choice; attack nearest non-demons\",\n\tdescriptionFull : \"You utter foul words, summoning demons from the chaos of the Abyss. Roll on the following table to determine what appears.\" + \"\\n\\n \" + toUni(\"d6\") + \"\\t\" + toUni(\"Demons Summoned\") + \"\\n  1-2\\tTwo demons of challenge rating 1 or lower\" + \"\\n  3-4\\tFour demons of challenge rating 1/2 or lower\" + \"\\n  5-6\\tEight demons of challenge rating 1/4 or lower\" + \"\\n\\n   \" + \"The DM chooses the demons, such as manes or dretches, and you choose the unoccupied spaces you can see within range where they appear. A summoned demon disappears when it drops to 0 hit points or when the spell ends.\" + \"\\n   \" + \"The demons are hostile to all creatures, including you. Roll initiative for the summoned demons as a group, which has its own turns. The demons pursue and attack the nearest non-demons to the best of their ability.\" + \"\\n   \" + \"As part of casting the spell, you can form a circle on the ground with the blood used as a material component. The circle is large enough to encompass your space. While the spell lasts, the summoned demons can't cross the circle or harm it, and they can't target anyone within it. Using the material component in this manner consumes it when the spell ends.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 6th or 7th level, you summon twice as many demons. If you cast it using a spell slot of 8th or 9th level, you summon three times as many demons.\"\n}",
    "synaptic static]": "{\n\tname : \"Synaptic Static\",\n\tclasses : [\"bard\", \"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 167],\n\tritual : false,\n\tlevel : 5,\n\tschool : \"Ench\",\n\ttime : \"1 a\",\n\trange : \"120 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Instant, 1 min\",\n\tsave : \"Int\",\n\tdescription : \"20-ft rad all crea Int>2 save or 8d6 Psychic dmg, -1d6 on atks/check/conc. save; save half, no -1d6\",\n\tdescriptionFull : \"You choose a point within range and cause psychic energy to explode there. Each creature in a 20-foot-radius sphere centered on that point must make an Intelligence saving throw. A creature with an Intelligence score of 2 or lower can't be affected by this spell. A target takes 8d6 psychic damage on a failed save, or half as much damage on a successful one.\" + \"\\n   \" + \"After a failed save, a target has muddled thoughts for 1 minute. During that time, it rolls a d6 and subtracts the number rolled from all its attack rolls and ability checks, as well as its Constitution saving throws to maintain concentration. The target can make an Intelligence saving throw at the end of each of its turns, ending the effect on itself on a success.\"\n}",
    "temple of the gods]": "{\n\tname : \"Temple of the Gods\",\n\tclasses : [\"cleric\"],\n\tsource : [\"X\", 167],\n\tritual : false,\n\tlevel : 7,\n\tschool : \"Conj\",\n\ttime : \"1 h\",\n\trange : \"120 ft\",\n\tcomponents : \"V,S,M\\u0192\",\n\tcompMaterial : \"A holy symbol worth at least 5 gp\",\n\tduration : \"24 h\",\n\tdescription : \"Create a temple 120 ft on a side to the deity of a holy symbol used; see book for effects\",\n\tdescriptionFull : \"You cause a temple to shimmer into existence on ground you can see within range. The temple must fit within an unoccupied cube of space, up to 120 feet on each side. The temple remains until the spell ends. It is dedicated to whatever god, pantheon, or philosophy is represented by the holy symbol used in the casting.\" + \"\\n   \" + \"You make all decisions about the temple's appearance. The interior is enclosed by a floor, walls, and a roof, with one door granting access to the interior and as many windows as you wish. Only you and any creatures you designate when you cast the spell can open or close the door.\" + \"\\n   \" + \"The temple's interior is an open space with an idol or altar at one end. You decide whether the temple is illuminated and whether that illumination is bright light or dim light. The smell of burning incense fills the air within, and the temperature is mild.\" + \"\\n   \" + \"The temple opposes types of creatures you choose when you cast this spell. Choose one or more of the following: celestials, elementals, fey, fiends, or undead. If a creature of the chosen type attempts to enter the temple, that creature must make a Charisma saving throw. On a failed save, it can't enter the temple for 24 hours. Even if the creature can enter the temple, the magic there hinders it; whenever it makes an attack roll, an ability check, or a saving throw inside the temple, it must roll a d4 and subtract the number rolled from the d20 roll.\" + \"\\n   \" + \"In addition, the sensors created by divination spells can't appear inside the temple, and creatures within can't be targeted by divination spells.\" + \"\\n   \" + \"Finally, whenever any creature in the temple regains hit points from a spell of 1st level or higher, the creature regains additional hit points equal to your Wisdom modifier (minimum 1 hit point).\" + \"\\n   \" + \"The temple is made from opaque magical force that extends into the Ethereal Plane, thus blocking ethereal travel into the temple's interior. Nothing can physically pass through the temple's exterior. It can't be dispelled by dispel magic, and antimagic field has no effect on it. A disintegrate spell destroys the temple instantly.\" + \"\\n   \" + \"Casting this spell on the same spot once every 7 days for a year makes this effect permanent.\"\n}",
    "tenser's transformation]": "{\n\tname : \"Tenser's Transformation\",\n\tclasses : [\"wizard\"],\n\tsource : [\"X\", 168],\n\tritual : false,\n\tlevel : 6,\n\tschool : \"Trans\",\n\ttime : \"1 a\",\n\trange : \"Self\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A few hairs from a bull\",\n\tduration : \"Conc, 10 min\",\n\tdescription : \"50 temp HP; prof Str/Con save, all wea/arm; extra atk; adv., +1d12 Force dmg on wea atks; no spellc.\",\n\tdescriptionFull : \"You endow yourself with endurance and martial prowess fueled by magic. Until the spell ends, you can't cast spells, and you gain the following benefits:\" + \"\\n \\u2022 \" + \"You gain 50 temporary hit points. If any of these remain when the spell ends, they are lost.\" + \"\\n \\u2022 \" + \"You have advantage on attack rolls that you make with simple and martial weapons.\" + \"\\n \\u2022 \" + \"When you hit a target with a weapon attack, that target takes an extra 2d12 force damage.\" + \"\\n \\u2022 \" + \"You have proficiency with all armor, shields, simple weapons, and martial weapons.\" + \"\\n \\u2022 \" + \"You have proficiency in Strength and Constitution saving throws.\" + \"\\n \\u2022 \" + \"You can attack twice, instead of once, when you take the Attack action on your turn. You ignore this benefit if you already have a feature, like Extra Attack, that gives you extra attacks.\" + \"\\n   \" + \"Immediately after the spell ends, you must succeed on a DC 15 Constitution saving throw or suffer one level of exhaustion.\"\n}",
    "thunder step]": "{\n\tname : \"Thunder Step\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 168],\n\tritual : false,\n\tlevel : 3,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"90 ft\",\n\tcomponents : \"V\",\n\tduration : \"Instantaneous\",\n\tsave : \"Con\",\n\tdescription : \"You + willing crea teleport 90 ft; all crea in 10 ft of left spot 3d10+1d10/SL Thunder dmg; save half\",\n\tdescriptionFull : \"You teleport yourself to an unoccupied space you can see within range. Immediately after you disappear, a thunderous boom sounds, and each creature within 10 feet of the space you left must make a Constitution saving throw, taking 3d10 thunder damage on a failed save, or half as much damage on a successful one. The thunder can be heard from up to 300 feet away.\" + \"\\n   \" + \"You can bring along objects as long as their weight doesn't exceed what you can carry. You can also teleport one willing creature of your size or smaller who is carrying gear up to its carrying capacity. The creature must be within 5 feet of you when you cast this spell, and there must be an unoccupied space within 5 feet of your destination space for the creature to appear in; otherwise, the creature is left behind.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d10 for each slot level above 3rd.\"\n}",
    "tiny servant]": "{\n\tname : \"Tiny Servant\",\n\tclasses : [\"wizard\"],\n\tsource : [\"X\", 168],\n\tritual : false,\n\tlevel : 3,\n\tschool : \"Trans\",\n\ttime : \"1 min\",\n\trange : \"Touch\",\n\tcomponents : \"V,S\",\n\tduration : \"8 h\",\n\tdescription : \"Animate 1+2/SL Tiny, nonmagical, unattended obj as tiny servants; bns a to command telepathically\",\n\tdescriptionFull : \"You touch one Tiny, nonmagical object that isn't attached to another object or a surface and isn't being carried by another creature. The target animates and sprouts little arms and legs, becoming a creature under your control until the spell ends or the creature drops to 0 hit points. See the Tiny Servant stat block for its statistics.\" + \"\\n   \" + \"As a bonus action, you can mentally command the creature if it is within 120 feet of you. (If you control multiple creatures with this spell, you can command any or all of them at the same time, issuing the same command to each one.) You decide what action the creature will take and where it will move during its next turn, or you can issue a simple, general command, such as to fetch a key, stand watch, or stack some books. If you issue no commands, the servant does nothing other than defend itself against hostile creatures. Once given an order, the servant continues to follow that order until its task is complete.\" + \"\\n   \" + \"When the creature drops to 0 hit points, it reverts to its original form, and any remaining damage carries over to that form.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 4th level or higher, you can animate two additional objects for each slot level above 3rd.\"\n}",
    "toll the dead-xgte]": "{\n\tname : \"Toll the Dead\",\n\tclasses : [\"cleric\", \"warlock\", \"wizard\"],\n\tsource : [[\"X\", 169], [\"UA:SS\", 4]],\n\tritual : false,\n\tlevel : 0,\n\tschool : \"Necro\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Instantaneous\",\n\tsave : \"Wis\",\n\tdescription : \"1 crea save or 1d12 Necrotic damage (only 1d8 if at full hp); +1d12/+1d8 at CL 5, 11, and 17\",\n\tdescriptionFull : \"You point at one creature you can see within range, and the sound of a dolorous bell fills the air around it for a moment. The target must succeed on a Wisdom saving throw or take 1d8 necrotic damage. If the target is missing any of its hit points, it instead takes 1d12 necrotic damage.\" + \"\\n   \" + \"The spell's damage increases by one die when you reach 5th level (2d8 or 2d12), 11th level (3d8 or 3d12), and 17th level (4d8 or 4d12).\"\n}",
    "wall of light]": "{\n\tname : \"Wall of Light\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"X\", 170],\n\tritual : false,\n\tlevel : 5,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"120 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A hand mirror\",\n\tduration : \"Conc, 10 min\",\n\tsave: \"Con\",\n\tdescription : \"60\\u00D75\\u00D710ft (l\\u00D7w\\u00D7h) 4d8+1d8/SL Radiant dmg & blind; save half, not blind; 1 a rngd spell atk; see B\",\n\tdescriptionMetric : \"18\\u00D71,5\\u00D73m (l\\u00D7w\\u00D7h) 4d8+1d8/SL Radiant dmg & blind; save half, not blind; 1 a rngd spell atk; see B\",\n\tdescriptionFull : \"A shimmering wall of bright light appears at a point you choose within range. The wall appears in any orientation you choose: horizontally, vertically, or diagonally. It can be free floating, or it can rest on a solid surface. The wall can be up to 60 feet long, 10 feet high, and 5 feet thick. The wall blocks line of sight, but creatures and objects can pass through it. It emits bright light out to 120 feet and dim light for an additional 120 feet.\" + \"\\n   \" + \"When the wall appears, each creature in its area must make a Constitution saving throw. On a failed save, a creature takes 4d8 radiant damage, and it is blinded for 1 minute. On a successful save, it takes half as much damage and isn't blinded. A blinded creature can make a Constitution saving throw at the end of each of its turns, ending the effect on itself on a success.\" + \"\\n   \" + \"A creature that ends its turn in the wall's area takes 4d8 radiant damage.\" + \"\\n   \" + \"Until the spell ends, you can use an action to launch a beam of radiance from the wall at one creature you can see within 60 feet of it. Make a ranged spell attack. On a hit, the target takes 4d8 radiant damage. Whether you hit or miss, reduce the length of the wall by 10 feet. If the wall's length drops to 0 feet, the spell ends.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d8 for each slot level above 5th.\"\n}",
    "word of radiance]": "{\n\tname : \"Word of Radiance\",\n\tclasses : [\"cleric\"],\n\tsource : [\"X\", 171],\n\tritual : false,\n\tlevel : 0,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"5 ft\",\n\tcomponents : \"V,M\",\n\tcompMaterial : \"A holy symbol\",\n\tduration : \"Instantaneous\",\n\tsave : \"Con\",\n\tdescription : \"Any crea within range save or 1d6 Radiant damage; +1d6 at CL 5, 11, and 17\",\n\tdescriptionFull : \"You utter a divine word, and burning radiance erupts from you. Each creature of your choice that you can see within range must succeed on a Constitution saving throw or take 1d6 radiant damage.\" + \"\\n   \" + \"The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).\"\n}",
    "wrath of nature]": "{\n\tname : \"Wrath of Nature\",\n\tclasses : [\"druid\", \"ranger\"],\n\tsource : [\"X\", 171],\n\tritual : false,\n\tlevel : 5,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"120 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"60-ft cu dif. ter., tree: Dex or 4d6 Slash. dmg, root: Str or restr., rock: rngd atk 3d8 Bludg. dmg; see B \",\n\tdescriptionFull : \"You call out to the spirits of nature to rouse them against your enemies. Choose a point you can see within range. The spirits cause trees, rocks, and grasses in a 60-foot cube centered on that point to become animated until the spell ends.\" + \"\\n   \" + toUni(\"Grasses and Undergrowth\") + \": Any area of ground in the cube that is covered by grass or undergrowth is difficult terrain for your enemies.\" + \"\\n   \" + toUni(\"Trees\") + \": At the start of each of your turns, each of your enemies within 10 feet of any tree in the cube must succeed on a Dexterity saving throw or take 4d6 slashing damage from whipping branches.\" + \"\\n   \" + toUni(\"Roots and Vines\") + \": At the end of each of your turns, one creature of your choice that is on the ground in the cube must succeed on a Strength saving throw or become restrained until the spell ends. A restrained creature can use an action to make a Strength (Athletics) check against your spell save DC, ending the effect on itself on a success.\" + \"\\n   \" + toUni(\"Rocks\") + \": As a bonus action on your turn, you can cause a loose rock in the cube to launch at a creature you can see in the cube. Make a ranged spell attack against the target. On a hit, the target takes 3d8 nonmagical bludgeoning damage, and it must succeed on a Strength saving throw or fall prone.\"\n}",
    "zephyr strike-xgte]": "{ \n\tname : \"Zephyr Strike\",\n\tclasses : [\"ranger\"],\n\tsource : [\"X\", 171],\n\tritual : false,\n\tlevel : 1,\n\tschool : \"Trans\",\n\ttime : \"1 bns\",\n\trange : \"Self\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"Moving doesn't provoke opportunity atks; once: adv. on wea atk, +1d8 Force dmg, +30 ft spd for turn\",\n\tdescriptionFull : \"You move like the wind. Until the spell ends, your movement doesn't provoke opportunity attacks.\" + \"\\n   \" + \"Once before the spell ends, you can give yourself advantage on one weapon attack roll on your turn. That attack deals an extra 1d8 force damage on a hit. Whether you hit or miss, your walking speed increases by 30 feet until the end of that turn.\"\n}",
    "gust]) {\n\tSpellsList[gust]": "{\n\t\tname : \"Gust\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"WGtE\", 107], [\"X\", 157], [\"E\", 19], [\"UA:D\", 6]],\n\t\tlevel : 0,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"30 ft\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Str\",\n\t\tdescription : \"Med. or smaller crea save or push 5 ft; or push unattended 5 lb obj 10 ft; or harmless sensory effect\",\n\t\tdescriptionFull : \"You seize the air and compel it to create one of the following effects at a point you can see within range.\" + \"\\n \" + \"\\u2022 One Medium or smaller creature that you choose must succeed on a Strength saving throw or be pushed up to 5 feet away from you.\" + \"\\n \" + \"\\u2022 You create a small blast of air capable of moving one object that is neither held nor carried and that weighs no more than 5 pounds. The object is pushed up to 10 feet away from you. It isn't pushed with enough force to cause damage.\" + \"\\n \" + \"\\u2022 You create a harmless sensory affect using air, such as causing leaves to rustle, wind to slam shutters shut, or your clothing to ripple in a breeze.\"\n\t}",
    "encode thoughts]": "{\n\tname : \"Encode Thoughts\",\n\tclasses : [],\n\tsource : [\"G\", 47],\n\tritual : false,\n\tlevel : 0,\n\tschool : \"Ench\",\n\ttime : \"1 a\",\n\trange : \"Self\",\n\tcomponents : \"S\",\n\tduration : \"Up to 8 h\",\n\tdescription : \"Make physical through strand of memory or vice versa; works with detect thoughts \\u0026 modify memory\",\n\tdescriptionFull : \"Putting a finger to your head, you pull a memory, an idea, or a message from your mind and transform it into a tangible string of glowing energy called a thought strand, which persists for the duration or until you cast this spell again. The thought strand appears in an unoccupied space within 5 feet of you as a Tiny, weightless, semisolid object that can be held and carried like a ribbon. It is otherwise stationary.\" + \"\\n   \" + \"If you cast this spell while concentrating on a spell or an ability that allows you to read or manipulate the thoughts of others (such as detect thoughts or modify memory), you can transform the thoughts or memories you read, rather than your own, into a thought strand.\" + \"\\n   \" + \"Casting this spell while holding a thought strand allows you to instantly receive whatever memory, idea, or message the thought strand contains. (Casting detect thoughts on the strand has the same effect.)\"\n}",
    "arcane hacking]": "{\n\tname : \"Arcane Hacking\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:MM\", 5],\n\tritual : false,\n\tlevel : 2,\n\tschool : \"Trans\",\n\ttime : \"1 a\",\n\trange : \"Self\",\n\tcomponents : \"V,S,M\\u0192\",\n\tcompMaterial : \"Hacking tools\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"Adv on Int (hacking tools) vs. encryption; Use Int (hacking tools) to remove protective spells; See book\",\n\tdescriptionFull : \"[Technomagic]\\n   You gain advantage on all Intelligence checks using hacking tools to break software encryption or online security when using a foreign system. This spell also allows you to break 2nd-level and lower protective spells such as arcane lock or glyph of warding by making an Intelligence check using hacking tools against the spell save DC of the spell's caster.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 3rd level or higher, you can attempt to counteract a spell set to secure the foreign system if the spell's level is equal to or less than the level of the spell slot you used.\"\n}",
    "commune with city]": "{\n\tname : \"Commune with City\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:MM\", 5],\n\tritual : true,\n\tlevel : 5,\n\tschool : \"Div\",\n\ttime : \"1 min\",\n\trange : \"Self\",\n\tcomponents : \"V,S\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Learn up to three facts about surrounding city, out to 1 mile above- or 600 ft underground; see B\",\n\tdescriptionFull : \"You briefly become one with the city and gain knowledge of the surrounding area. Aboveground, this spell gives you knowledge of the area within 1 mile of you. In sewers and other underground settings, you gain knowledge of the area within 600 feet of you.\" + \"\\n   \" + \"You instantly gain knowledge of up to three facts of your choice about any of the following subjects as they relate to the area:\" + \"\\n  \\u2022 \" + \"Terrain and bodies of water\" + \"\\n  \\u2022 \" + \"Prevalent buildings, plants, animals, or intelligent creatures\" + \"\\n  \\u2022 \" + \"Powerful (CR 1 or higher) celestials, fey, fiends, elementals, or undead\" + \"\\n  \\u2022 \" + \"Influences from other planes of existence\" + \"\\n  \\u2022 \" + \"Electrical currents, wireless signals, and active transit lines and tracks\" + \"\\n\\n   \" + \"For example, you could determine the location of powerful undead in the area, the location of major sources of electrical power or interference, and the location of any nearby parks.\"\n}",
    "conjure knowbot]": "{\n\tname : \"Conjure Knowbot\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:MM\", 5],\n\tritual : false,\n\tlevel : 4,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"500 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"10 min\",\n\tdescription : \"Create bot in touched device; computer checks 1 bns instead of 1 a for me; SL5: 1 h, 1000 ft, see book\",\n\tdescriptionFull : \"[Technomagic]\\n   You touch a single computerized device or computer system to conjure a knowbot\\u2014a partially sentient piece of software imprinted with vestiges of your own skills and computer abilities. For the duration of the spell, you can use a bonus action to have the knowbot execute a computer-related task that would normally require an action. The knowbot makes Intelligence ability checks using your ability score and proficiency bonuses (including your proficiency with hacking tools, if applicable).\" + \"\\n   \" + \"You have a limited telepathic bond with the knowbot, out to a range of 500 feet from the device or system where the knowbot was conjured. If you move beyond this range, the knowbot disappears in 2d4 rounds, as if the duration of the spell had expired. Moving within range again immediately reestablishes the bond. The knowbot is bound to the system in which it was created, and it stays there until it is dismissed or the spell's duration expires.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 5th level or higher, the spell's duration increases to 1 hour. Additionally, your telepathic bond with the knowbot is effective out to a range of 1,000 feet, and if you leave the range of the bond, the knowbot continues performing its last directed task until the spell expires.\"\n}",
    "digital phantom]": "{\n\tname : \"Digital Phantom\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:MM\", 6],\n\tritual : false,\n\tlevel : 2,\n\tschool : \"Abjur\",\n\ttime : \"1 a\",\n\trange : \"Self\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A small piece of copper wire\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"You and any others in same computer system +10 on Int to avoid detection; leave no trace on exit\",\n\tdescriptionFull : \"[Technomagic]\\n   This spell works to actively hide your presence within a computer system. For the spell's duration, you and any other users you choose on your local network gain a +10 bonus to Intelligence checks to avoid detection by administrators, knowbots, tracking software, and the like. Whenever you and your chosen users leave any computer system you are working in while this spell is in effect, all trace of your previous presence in that system is erased.\"\n}",
    "find vehicle]": "{\n\tname : \"Find Vehicle\",\n\tclasses : [\"paladin\", \"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:MM\", 6],\n\tritual : false,\n\tlevel : 2,\n\tschool : \"Conj\",\n\ttime : \"10 min\",\n\trange : \"30 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"Gain services of land spirit-vehicle; expertise, share spells with it; SL3: water, SL5: air, SL7: any; see B\",\n\tdescriptionFull : \"You summon a spirit that assumes the form of a nonmilitary land vehicle of your choice, appearing in an unoccupied space within range. The vehicle has the statistics of a normal vehicle of its sort, though it is celestial, fey, or fiendish (your choice) in origin. The physical characteristics of the vehicle reflect its origin to some degree. For example, a fiendish SUV might be jet black in color, with tinted windows and a sinister-looking front grille.\" + \"\\n   \" + \"You have a supernatural bond with the conjured vehicle that allows you to drive beyond your normal ability. While driving the conjured vehicle, you are considered proficient with vehicles of its type, and you add double your proficiency bonus to ability checks related to driving the vehicle. While driving the vehicle, you can make any spell you cast that targets only you also target the vehicle.\" + \"\\n   \" + \"If the vehicle drops to 0 hit points, it disappears, leaving behind no physical form. You can also dismiss the vehicle at any time as an action, causing it to disappear.\" + \"\\n   \" + \"You can't have more than one vehicle bonded by this spell at a time. As an action, you can release the vehicle from its bond at any time, causing it to disappear.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 3rd level or higher, you can conjure a nonmilitary water vehicle large enough to carry six Medium creatures. When you cast this spell using a spell slot of 5th level or higher, you can conjure a nonmilitary air vehicle large enough to carry ten Medium creatures. When you cast this spell using a spell slot of 7th level or higher, you can conjure any type of vehicle, subject to the DM's approval.\"\n}",
    "haywire]": "{\n\tname : \"Haywire\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:MM\", 7],\n\tritual : false,\n\tlevel : 3,\n\tschool : \"Ench\",\n\ttime : \"1 a\",\n\trange : \"90 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Wis\",\n\tdescription : \"10 ft(+5 ft/SL) rad all electronic devices go haywire, see B; for hold devices, crea gets to save\",\n\tdescriptionFull : \"[Technomagic]\\n   This spell plays havoc with electronic devices, making the use of such devices all but impossible. Each electronic device in a 10-foot-radius sphere centered on a point you choose within range is subject to random behavior while it remains within the area. A device not held by a creature is automatically affected. If an electronic device is held by a creature, that creature must succeed on a Wisdom saving throw or have the device affected by the spell.\" + \"\\n   \" + \"At the start of each of your turns, roll a d6 for each affected device to determine its behavior. Except where otherwise indicated, that behavior lasts until the start of your next turn while this spell is in effect.\" + \"\\n\\n\" + toUni(\"d10\") + \"\\t\" + toUni(\"Behavior\") + \"\\n  \" + \"1\\tThe device shuts down and must be restarted. Do not roll again for this device until it is restarted.\\n2–4\\tThe device does not function.\" + \"\\n  \" + \"5\\tThe device experiences a power surge, causing an electric shock to the wielder (if any) and one random creature within 5 feet of the device. Each affected creature must make a Dexterity saving throw against your spell save DC, taking 6d6 lightning damage on a failed save, or half as much damage on a successful one.\" + \"\\n  \" + \"6\\tThe device is usable as normal.\\n\" + AtHigherLevels + \"When you cast this spell using a spell slot of 4th level or higher, the radius of the sphere affected by the spell increases by 5 feet for each slot level above 3rd.\"\n}",
    "infallible relay]": "{\n\tname : \"Infallible Relay\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:MM\", 7],\n\tritual : false,\n\tlevel : 1,\n\tschool : \"Div\",\n\ttime : \"1 min\",\n\trange : \"Self\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A mobile phone\",\n\tduration : \"Conc, 10 min\",\n\tsave : \"Cha\",\n\tdescription : \"1 known crea save or has to answer your call from phone within 100 ft of it; it has to save to end call\",\n\tdescriptionFull : \"[Technomagic]\\n   With this spell, you can target any creature with whom you have spoken previously, as long as the two of you are on the same plane of existence. When you cast the spell, the nearest functioning telephone or similar communications device within 100 feet of the target begins to ring. If there is no suitable device close enough to the target, the spell fails.\" + \"\\n   \" + \"The target must make a successful Charisma saving throw or be compelled to answer your call. Once the connection is established, the call is crystal clear and cannot be dropped until the conversation has ended or the spell's duration ends. You can end the conversation at any time, but a target must succeed on a Charisma saving throw to end the conversation.\"\n}",
    "invisibility to cameras]": "{\n\tname : \"Invisibility to Cameras\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:MM\", 7],\n\tritual : false,\n\tlevel : 3,\n\tschool : \"Illus\",\n\ttime : \"1 a\",\n\trange : \"10 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A scrap of black paper\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"Up to 4 crea and anything they are wearing or carrying become undetectable for electornic sensors\",\n\tdescriptionFull : \"[Technomagic]\\n   Four creatures of your choice within range become undetectable to electronic sensors and cameras for the duration of the spell. Anything a target is wearing or carrying is likewise undetectable as long as it is on the target's person. The targets remain visible to vision.\"\n}",
    "on/off]": "{\n\tname : \"On/Off\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:MM\", 7],\n\tritual : false,\n\tlevel : 0,\n\tschool : \"Trans\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Activate or deactivate 1 electornic device that has a way of doing so accessible from the outside of it\",\n\tdescriptionFull : \"[Technomagic]\\n   This cantrip allows you to activate or deactivate any electronic device within range, as long as the device has a clearly defined on or off function that can be easily accessed from the outside of the device. Any device that requires a software- based shutdown sequence to activate or deactivate cannot be affected by on/off.\"\n}",
    "protection from ballistics]": "{\n\tname : \"Protection from Ballistics\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:MM\", 8],\n\tritual : false,\n\tlevel : 3,\n\tschool : \"Abjur\",\n\ttime : \"1 a\",\n\trange : \"Touch\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A shell casing\",\n\tduration : \"Conc, 10 min\",\n\tdescription : \"1 crea gains resistance to nonmagical ballistic damage\",\n\tdescriptionFull : \"This spell enchants the flesh of the target against the impact of bullets. Until the spell ends, the target has resistance to nonmagical ballistic damage.\"\n}",
    "remote access]": "{\n\tname : \"Remote Access\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:MM\", 8],\n\tritual : false,\n\tlevel : 1,\n\tschool : \"Trans\",\n\ttime : \"1 a\",\n\trange : \"120 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"10 min\",\n\tdescription : \"You can use any electronic device within range as if it were in your hands\",\n\tdescriptionFull : \"[Technomagic]\\n   You can use any electronic device within range as if it were in your hands. This is not a telekinesis effect. Rather, this spell allows you to simulate a device's mechanical functions electronically. You are able to access only functions that a person using the device manually would be able to access. You can use remote access with only one device at a time.\"\n}",
    "shutdown]": "{\n\tname : \"Shutdown\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:MM\", 8],\n\tritual : false,\n\tlevel : 5,\n\tschool : \"Trans\",\n\ttime : \"1 a\",\n\trange : \"120 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Con\",\n\tdescription : \"Shut down all electronic devices within range; if controlled/held by crea, it can save to keep active\",\n\tdescriptionFull : \"[Technomagic]\\n   This spell shuts down all electronic devices within range that are not wielded by or under the direct control of a creature. If an electronic device within range is used by a creature, that creature must succeed on a Constitution saving throw to prevent the device from being shut down. While the spell remains active, no electronic device within range can be started or restarted.\"\n}",
    "synchronicity]": "{\n\tname : \"Synchronicity\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:MM\", 8],\n\tritual : false,\n\tlevel : 4,\n\tschool : \"Ench\",\n\ttime : \"1 a\",\n\trange : \"120 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"1 crea not slowed by mundane delays, disadv on opportunity attacks to it, adv to Stealth and driving\",\n\tdescriptionFull : \"The creature you touch feels reality subtly shifted to its favor while this spell is in effect.\" + \"\\n   \" + \"The target isn't inconvenienced by mundane delays of any sort. Traffic lights are always green, there's always a waiting elevator, and a taxi is always around the corner. The target can run at full speed through dense crowds, and attacks of opportunity provoked by the target's movement are made with disadvantage.\" + \"\\n   \" + \"Synchronicity grants advantage to Dexterity (Stealth) checks, since the target always finds a handy piece of cover available. Additionally, the target has advantage on all ability checks made to drive a vehicle.\" + \"\\n   \" + \"In the event that two or more creatures under the effect of synchronicity are attempting to avoid being inconvenienced by each other, the creatures engage in a contest of Charisma each time the effects of the spells would oppose each other.\"\n}",
    "system backdoor]": "{\n\tname : \"System Backdoor\",\n\tclasses : [\"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:MM\", 8],\n\tritual : false,\n\tlevel : 4,\n\tschool : \"Trans\",\n\ttime : \"1 min\",\n\trange : \"Self\",\n\tcomponents : \"V,S,M\\u0192\",\n\tcompMaterial : \"Hacking tools\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"Gain admin access to 1 system; defeats 3rd or lower technomancy spells; SL5+: defeats same or lower\",\n\tdescriptionFull : \"[Technomagic]\\n   This spell allows you to bypass system security in order to create a secure login on a foreign system. The login you create allows you administrator-level privileges in any computer system not enhanced through technomagic. The login defeats any technomagic spells of 3rd level or lower.\" + \"\\n   \" + \"Once the duration of the spell expires, the login and all privileges are wiped from the system.\" + \"\\n   \" + \"System logs still show the activity of the user, but the user identification cannot be found or traced.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 5th level or higher, you are able to bypass technomagic spells if the spell's level is equal to or less than the level of the spell slot you used.\"\n}",
    "conjure lesser demon]": "{\n\tname : \"Conjure Lesser Demon\",\n\tclasses : [\"sorcerer\", \"wizard\"],\n\tsource : [\"UA:TOBM\", 2],\n\tritual : false,\n\tlevel : 3,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A vial of blood from an intelligent humanoid killed within the past 24 hours\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"Summon 8 (16 at SL6, 32 at SL8) manes/dretches that are hostile to all non-demons, attacking nearest\",\n\tdescriptionFull : \"You summon up to a total of eight manes or dretches that appear in unoccupied spaces you can see within range. A manes or dretch disappears when it drops to 0 hit points or when the spell ends.\" + \"\\n   \" + \"The demons are hostile to all creatures. Roll initiative for the summoned demons as a group, which has its own turns. The demons attack the nearest non-demons to the best of their ability.\" + \"\\n   \" + \"As part of casting the spell, you can scribe a circle on the ground with the blood used as a material component. The circle is large enough to encompass your space. The summoned demons cannot cross the circle or target anyone in it while the spell lasts. Using the material component in this manner consumes it.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 6th or 7th level, you summon sixteen demons. If you cast it using a spell slot of 8th or 9th level, you summon thirty-two demons.\"\n}",
    "conjure barlgura]": "{\n\tname : \"Conjure Barlgura\",\n\tclasses : [\"sorcerer\", \"wizard\"],\n\tsource : [\"UA:TOBM\", 2],\n\tritual : false,\n\tlevel : 4,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"10 min\",\n\tdescription : \"Summon a barlgura that is hostile to all non-demons, attacking the nearest\",\n\tdescriptionFull : \"You summon a barlgura that appears in an unoccupied space you can see within range. The barlgura disappears when it drops to 0 hit points or when the spell ends.\" + \"\\n   \" + \"The barlgura is hostile to all non-demons. Roll initiative for the barlgura, which has its own turns. At the start of its turn, it moves toward and attacks the nearest non-demon it can perceive. If two or more creatures are equally near, it picks one at random. If it cannot see any potential enemies, the barlgura moves in a random direction in search of foes.\" + \"\\n   \" + \"As part of casting the spell, you can scribe a circle on the ground using the blood of an intelligent humanoid slain within the past 24 hours. The circle is large enough to encompass your space. The summoned barlgura cannot cross the circle or target anyone in it while the spell lasts.\"\n}",
    "conjure hezrou]": "{\n\tname : \"Conjure Hezrou\",\n\tclasses : [\"sorcerer\", \"wizard\"],\n\tsource : [\"UA:TOBM\", 2],\n\tritual : false,\n\tlevel : 7,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S,M\\u2020\",\n\tcompMaterial : \"Food worth at least 100 gp, which the spell consumes\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"Summon a hezrou that I might control as long as there is food; At half HP it leaves, see B (100gp cons.)\",\n\tdescriptionFull : \"You summon a hezrou that appears in an unoccupied space you can see within range. The hezrou disappears when it drops to 0 hit points or when the spell ends.\" + \"\\n   \" + \"The hezrou's attitude depends on the value of the food used as a material component for this spell. Roll initiative for the hezrou, which has its own turns. At the start of the hezrou's turn, the DM makes a secret Charisma check on your behalf, with a bonus equal to the food's value divided by 20. The check DC starts at 10 and increases by 2 each round. You can issue orders to the hezrou and have it obey you as long as you succeed on the Charisma check.\" + \"\\n   \" + \"If the check fails, the spell no longer requires concentration and the demon is no longer under your control. The hezrou then focuses on devouring any corpses it can see. If there are no such meals at hand, it attacks the nearest creatures and eats anything it kills. If its hit points are reduced to below half its hit point maximum, it returns to the Abyss.\" + \"\\n   \" + \"As part of casting the spell, you can scribe a circle on the ground using the blood of an intelligent humanoid slain within the past 24 hours. The circle is large enough to encompass your space. The summoned hezrou cannot cross the circle or target anyone in it while the spell lasts.\"\n}",
    "conjure shadow demon]": "{\n\tname : \"Conjure Shadow Demon\",\n\tclasses : [\"sorcerer\", \"wizard\"],\n\tsource : [\"UA:TOBM\", 3],\n\tritual : false,\n\tlevel : 4,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A vial of blood from an intelligent humanoid killed within the past 24 hours\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"Summon a shadow demon that I control while not in bright light, can attack, and within 100 ft, see B\",\n\tdescriptionFull : \"You summon a shadow demon that appears in an unoccupied space you can see within range. The shadow demon disappears when it drops to 0 hit points or when the spell ends.\" + \"\\n   \" + \"Roll initiative for the shadow demon, which has its own turns. You can issue orders to the shadow demon, and it obeys you as long as it can attack a creature on each of its turns and does not start its turn in an area of bright light. If either of these conditions is not met, the shadow demon immediately makes a Charisma check contested by your Charisma check. If you fail the check, the spell no longer requires concentration and the demon is no longer under your control. The demon automatically succeeds on the check if it is more than 100 feet away from you.\" + \"\\n   \" + \"As part of casting the spell, you can scribe a circle on the ground using the blood of an intelligent humanoid slain within the past 24 hours. The circle is large enough to encompass your space. The summoned shadow demon cannot cross the circle or target anyone in it while the spell lasts.\"\n}",
    "conjure vrock]": "{\n\tname : \"Conjure Vrock\",\n\tclasses : [\"sorcerer\", \"wizard\"],\n\tsource : [\"UA:TOBM\", 3],\n\tritual : false,\n\tlevel : 5,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S,M\\u2020\",\n\tcompMaterial : \"A gem worth at least 100 gp, which the spell consumes\",\n\tduration : \"Conc, 1 h\",\n\tdescription : \"Summon a vrock that I might control for some rounds, depending on gem value, see B (100gp cons.)\",\n\tdescriptionFull : \"You summon a vrock that appears in an unoccupied space you can see within range. The vrock disappears when it drops to 0 hit points or when the spell ends.\" + \"\\n   \" + \"The vrock's attitude depends on the value of the gem used as a material component for this spell. Roll initiative for the vrock, which has its own turns. At the start of the vrock's turn, the DM makes a secret Charisma check on your behalf, with a bonus equal to the gem's value divided by 20. The check DC starts at 10 and increases by 2 each round. You can issue orders to the vrock and have it obey you as long as you succeed on the Charisma check.\" + \"\\n   \" + \"If the check fails, the spell no longer requires concentration and the vrock is no longer under your control. The vrock takes no actions on its next turn and uses its telepathy to tell any creature it can see that it will fight in exchange for treasure. The creature that gives the vrock the most expensive gem can command it for the next 1d6 rounds. At the end of that time, it offers the bargain again. If no one offers the vrock treasure before its next turn begins, it attacks the nearest creatures for 1d6 rounds before returning to the Abyss.\" + \"\\n   \" + \"As part of casting the spell, you can scribe a circle on the ground using the blood of an intelligent humanoid slain within the past 24 hours. The circle is large enough to encompass your space. The summoned vrock cannot cross the circle or target anyone in it while the spell lasts.\"\n}",
    "cause fear]": "{\n\tname : \"Cause Fear\",\n\tclasses : [\"warlock\", \"wizard\"],\n\tsource : [\"UA:SS\", 2],\n\tritual : false,\n\tlevel : 1,\n\tschool : \"Necro\",\n\ttime : \"1 a\",\n\trange : \"60 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 1 min\",\n\tsave : \"Wis\",\n\tdescription : \"1 crea save or frightened; crea disadvantage on save if 25 hp or less; no effect on undead/constructs\",\n\tdescriptionFull : \"You awaken the sense of mortality in one creature you can see within range. The target must succeed on a Wisdom saving throw or become frightened for the duration. A target with 25 hit points or fewer makes the saving throw with disadvantage. The spell has no effect on constructs or undead.\"\n}",
    "ceremony]": "{\n\tname : \"Ceremony\",\n\tclasses : [\"cleric\", \"paladin\"],\n\tsource : [\"UA:SS\", 2],\n\tritual : true,\n\tlevel : 1,\n\tschool : \"Evoc\",\n\ttime : \"1 h\",\n\trange : \"Touch\",\n\tcomponents : \"V,S,M\\u0192\",\n\tcompMaterial : \"25 gp worth of powdered silver\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Perform religious ceremony on target(s) that are within 10 ft throughout the casting; see book (25gp)\",\n\tdescriptionFull : \"You perform one of several religious ceremonies. When you cast the spell, choose one of the following ceremonies, the target of which must be within 10 feet of you throughout the casting.\" + \"\\n   \" + toUni(\"Atonement\") + \": You touch one willing creature whose alignment has changed, and you make a DC 20 Wisdom (Insight) check. On a success, you restore the target to its original alignment.\" + \"\\n   \" + toUni(\"Bless Water\") + \": You touch one vial of water and cause it to become holy water.\" + \"\\n   \" + toUni(\"Coming of Age\") + \": You touch one humanoid old enough to be a young adult. For the next 24 hours, whenever the target makes an ability check, it can roll a d4 and add the number rolled to the ability check. A creature can benefit from this ceremony just once.\" + \"\\n   \" + toUni(\"Dedication\") + \": You touch one humanoid who would willingly convert to your religion or who wishes to be dedicated to your god's service. For the next 24 hours, whenever the target makes a saving throw, it can roll a d4 and add the number rolled to the save. A creature can benefit from this ceremony just once.\" + \"\\n   \" + toUni(\"Funeral Rite\") + \": You bless one corpse within 5 feet of you. For the next 24 hours, the target can't become undead by any means short of a wish spell.\" + \"\\n   \" + toUni(\"Investiture\") + \": You touch one willing humanoid. Choose one 1st-level spell you have prepared and expend a spell slot and any material components as if you were casting that spell. The spell has no effect. Instead, the target can cast this spell once without having to expend a spell slot or use material components. If the target doesn't cast the spell within 1 hour, the invested spell is lost.\" + \"\\n   \" + toUni(\"Marriage\") + \": You touch adult humanoids willing to be bonded together in marriage. For the next 24 hours, each target gains a +2 bonus to AC and saving throws while they are within 30 feet of each other. A creature can benefit from this ceremony just once.\"\n}",
    "chaos bolt]": "{\n\tname : \"Chaos Bolt\",\n\tclasses : [\"sorcerer\"],\n\tsource : [\"UA:SS\", 2],\n\tritual : false,\n\tlevel : 1,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"120 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Spell atk 2d8+1d6/SL dmg, d8s set dmg type, see B; double on d8s: new atk vs. crea in 30 ft of target\",\n\tdescriptionFull : \"You hurl an undulating, warbling mass of chaotic energy at one creature in range. Make a ranged spell attack against the target. On a hit, the target takes 2d8 damage. Choose one of the d8s. The number it rolled determines the type of damage, as shown below.\" + \"\\n\\n\" + toUni(\"d8\") + \"\\t\" + toUni(\"Damage Type\") + \"\\n  1\\tAcid\" + \"\\n  2\\tCold\" + \"\\n  3\\tFire\" + \"\\n  4\\tForce\" + \"\\n  5\\tLightning\" + \"\\n  6\\tPoison\" + \"\\n  7\\tPsychic\" + \"\\n  8\\tThunder\" + \"\\n\\n   \" + \"If you roll the same number on both d8s, the chaotic energy leaps from the target to a different creature of your choice within 30 feet of it. Make a new attack roll against the new target, and make a new damage roll, which could cause the chaotic energy to leap again.\" + \"\\n   \" + \"A creature can be targeted only once by this mass of chaotic energy.\" + AtHigherLevels + \"When you cast this spell using a spell slot of 2nd level or higher, each target takes extra damage of the type rolled. The extra damage equals 1d6 for each slot level above 1st.\"\n}",
    "guiding hand]": "{\n\tname : \"Guiding Hand\",\n\tclasses : [\"bard\", \"cleric\", \"druid\", \"wizard\"],\n\tsource : [\"UA:SS\", 3],\n\tritual : true,\n\tlevel : 1,\n\tschool : \"Div\",\n\ttime : \"1 min\",\n\trange : \"5 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 8 h\",\n\tdescription : \"Tiny incorporeal hand directs you to one major landmark you name that is on the same plane\",\n\tdescriptionFull : \"You create a Tiny incorporeal hand of shimmering light in an unoccupied space you can see within range. The hand exists for the duration, but it disappears if you teleport or you travel to a different plane of existence.\" + \"\\n   \" + \"When the hand appears, you name one major landmark, such as a city, mountain, castle, or battlefield on the same plane of existence as you. Someone in history must have visited the site and mapped it. If the landmark appears on no map in existence, the spell fails. Otherwise, whenever you move toward the hand, it moves away from you at the same speed you moved, and it moves in the direction of the landmark, always remaining 5 feet away from you.\" + \"\\n   \" + \"If you don't move toward the hand, it remains in place until you do and beckons for you to follow once every 1d4 minutes.\"\n}",
    "hand of radiance]": "{\n\tname : \"Hand of Radiance\",\n\tclasses : [\"cleric\"],\n\tsource : [\"UA:SS\", 3],\n\tritual : false,\n\tlevel : 0,\n\tschool : \"Evoc\",\n\ttime : \"1 a\",\n\trange : \"5-ft rad\",\n\tcomponents : \"V,S\",\n\tduration : \"Instantaneous\",\n\tsave : \"Con\",\n\tdescription : \"Any creatures you see in 5-ft radius save or 1d6 Radiant damage; +1d6 damage at CL 5, 11, and 17\",\n\tdescriptionFull : \"You raise your hand, and burning radiance erupts from it. Each creature of your choice that you can see within 5 feet of you must succeed on a Constitution saving throw or take 1d6 radiant damage.\" + \"\\n   \" + \"The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).\"\n}",
    "healing elixir]": "{\n\tname : \"Healing Elixir\",\n\tclasses : [\"warlock\", \"wizard\"],\n\tsource : [\"UA:SS\", 3],\n\tritual : false,\n\tlevel : 1,\n\tschool : \"Conj\",\n\ttime : \"1 min\",\n\trange : \"Self\",\n\tcomponents : \"V,S,M\\u0192\",\n\tcompMaterial : \"Alchemist's supplies\",\n\tduration : \"24 h\",\n\tdescription : \"Make vial with alchemist's supplies; heals 2d4+2 hp as an action; if not used, disappears after 24 h\",\n\tdescriptionFull : \"You create a healing elixir in a simple vial that appears in your hand. The elixir retains its potency for the duration or until it's consumed, at which point the vial vanishes.\" + \"\\n   \" + \"As an action, a creature can drink the elixir or administer it to another creature. The drinker regains 2d4 + 2 hit points.\"\n}",
    "infestation]": "{\n\tname : \"Infestation\",\n\tclasses : [\"druid\", \"sorcerer\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:SS\", 3],\n\tritual : false,\n\tlevel : 0,\n\tschool : \"Conj\",\n\ttime : \"1 a\",\n\trange : \"30 ft\",\n\tcomponents : \"V,S,M\",\n\tcompMaterial : \"A living flea\",\n\tduration : \"Instantaneous\",\n\tsave : \"Con\",\n\tdescription : \"1 crea save or 1d6 Piercing damage and moved 5 ft in random direction; +1d6 at CL 5, 11, and 17\",\n\tdescriptionFull : \"You cause mites, fleas, and other parasites to appear momentarily on one creature you can see within range. The target must succeed on a Constitution saving throw or take 1d6 piercing damage. If the target takes any of that damage, the target moves 5 feet in a random direction. Roll a d8 for the direction:\" + \"\\n\\n\" + toUni(\"d8\") + \"\\t\" + toUni(\"Direction\") + \"\\n  1\\tNorth\" + \"\\n  2\\tNortheast\" + \"\\n  3\\tEast\" + \"\\n  4\\tSoutheast\" + \"\\n  5\\tSouth\" + \"\\n  6\\tSouthwest\" + \"\\n  7\\tWest\" + \"\\n  8\\tNorthwest\" + \"\\n\\n   \" + \"The spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).\"\n}",
    "primal savagery]": "{\n\tname : \"Primal Savagery\",\n\tclasses : [\"druid\"],\n\tsource : [\"UA:SS\", 3],\n\tritual : false,\n\tlevel : 0,\n\tschool : \"Trans\",\n\ttime : \"1 a\",\n\trange : \"5 ft\",\n\tcomponents : \"S\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Melee spell attack deals 1d10 Piercing or Slashing dmg (your choice); +1d10 at CL 5, 11, and 17\",\n\tdescriptionFull : \"Your teeth or fingernails lengthen and sharpen. You choose which. Make a melee spell attack against one creature within 5 feet of you. On a hit, the target takes 1d10 piercing or slashing damage (your choice). After you make the attack, your teeth or fingernails return to normal.\" + \"\\n   \" + \"The spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).\"\n}",
    "puppet]": "{\n\tname : \"Puppet\",\n\tclasses : [\"bard\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:SS\", 3],\n\tritual : false,\n\tlevel : 1,\n\tschool : \"Ench\",\n\ttime : \"1 a\",\n\trange : \"120 ft\",\n\tcomponents : \"S\",\n\tduration : \"Instantaneous\",\n\tsave : \"Con\",\n\tdescription : \"1 humanoid save or move its speed to where you choose and drop held items, if chosen (charm effect)\",\n\tdescriptionFull : \"Your gesture forces one humanoid you can see within range to make a Constitution saving throw. On a failed save, the target must move up to its speed in a direction you choose. In addition, you can cause the target to drop whatever it is holding. This spell has no effect on a humanoid that is immune to being charmed.\"\n}",
    "sense emotion]": "{\n\tname : \"Sense Emotion\",\n\tclasses : [\"bard\", \"warlock\", \"wizard\"],\n\tsource : [\"UA:SS\", 4],\n\tritual : false,\n\tlevel : 1,\n\tschool : \"Div\",\n\ttime : \"1 a\",\n\trange : \"30 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Conc, 10 min\",\n\tdescription : \"Now and as 1 a for duration, sense emotion of humanoid in range; sense calm if not humanoid/charm\",\n\tdescriptionFull : \"You attune your senses to pick up the emotions of others for the duration. When you cast the spell, and as your action on each turn until the spell ends, you can focus your senses on one humanoid you can see within 30 feet of you. You instantly learn the target's prevailing emotion, whether it's love, anger, pain, fear, calm, or something else. If the target isn't actually humanoid or it is immune to being charmed, you sense that it is calm.\"\n}",
    "snare]": "{\n\tname : \"Snare\",\n\tclasses : [\"druid\", \"ranger\", \"wizard\"],\n\tsource : [\"UA:SS\", 4],\n\tritual : false,\n\tlevel : 1,\n\tschool : \"Abjur\",\n\ttime : \"1 min\",\n\trange : \"Touch\",\n\tcomponents : \"V,S,M\\u2020\",\n\tcompMaterial : \"30 feet of cord or rope, which is consumed by the spell\",\n\tduration : \"Dispel/trigger\",\n\tsave : \"Dex\",\n\tdescription : \"5-ft rad magical trap; Int (Inv) to see; save or restrained upside down 3 ft in the air; save/rnd at dis\",\n\tdescriptionFull : \"While you cast this spell, you use the cord or rope to create a circle with a 5-foot radius on a flat surface within your reach. When you finish casting, the cord or rope disappears to become a magical trap.\" + \"\\n   \" + \"The trap is nearly invisible and requires a successful Intelligence (Investigation) check against your spell save DC to be found.\" + \"\\n   \" + \"The trap triggers when a Small creature or larger moves into the area protected by the spell. The triggering creature must succeed on a Dexterity saving throw or fall prone and be hoisted into the air until it hangs upside down 3 feet above the protected surface, where it is restrained.\" + \"\\n   \" + \"The restrained creature can make a Dexterity saving throw with disadvantage at the end of each of its turns and ends the restrained effect on a success. Alternatively, another creature that can reach the restrained creature can use an action to make an Intelligence (Arcana) check against your spell save DC. On a success, the restrained effect also ends.\"\n}",
    "sudden awakening]": "{\n\tname : \"Sudden Awakening\",\n\tclasses : [\"bard\", \"ranger\", \"sorcerer\", \"wizard\"],\n\tsource : [\"UA:SS\", 4],\n\tritual : false,\n\tlevel : 1,\n\tschool : \"Ench\",\n\ttime : \"1 bns\",\n\trange : \"10 ft\",\n\tcomponents : \"V\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Any creatures within range awaken and can then stand up from prone without expending movement\",\n\tdescriptionFull : \"Each sleeping creature you choose within range awakens, and then each prone creature within range can stand up without expending any movement.\"\n}",
    "unearthly chorus]": "{\n\tname : \"Unearthly Chorus\",\n\tclasses : [\"bard\"],\n\tsource : [\"UA:SS\", 4],\n\tritual : false,\n\tlevel : 1,\n\tschool : \"Illus\",\n\ttime : \"1 a\",\n\trange : \"30-ft rad\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 10 min\",\n\tsave: \"Cha\",\n\tdescription : \"Use bns a to make 1 crea in range save or be friendly for 1 h; You adv on Cha (Performance) checks\",\n\tdescriptionFull : \"Music of a style you choose fills the air around you in a 30-foot radius. The music spreads around corners and can be heard from up to 100 feet away. The music moves with you, centered on you for the duration.\" + \"\\n   \" + \"Until the spell ends, you make Charisma (Performance) checks with advantage. In addition, you can use a bonus action on each of your turns to beguile one creature you choose within 30 feet of you that can see you and hear the music. The creature must make a Charisma saving throw. If you or your companions are attacking it, the creature automatically succeeds on the saving throw. On a failure, the creature becomes friendly to you for as long as it can hear the music and for 1 hour thereafter. You make Charisma (Deception) checks and Charisma (Persuasion) checks against creatures made friendly by this spell with advantage.\"\n}",
    "virtue]": "{\n\tname : \"Virtue\",\n\tclasses : [\"cleric\"],\n\tsource : [\"UA:SS\", 5],\n\tritual : false,\n\tlevel : 0,\n\tschool : \"Abjur\",\n\ttime : \"1 a\",\n\trange : \"Touch\",\n\tcomponents : \"V,S\",\n\tduration : \"1 rnd\",\n\tdescription : \"1 creature that has at least 1 hp gets 1d4 + spellcasting ability modifier in temporary hit points\",\n\tdescriptionFull : \"You touch one creature, imbuing it with vitality. If the target has at least 1 hit point, it gains a number of temporary hit points equal to 1d4 + your spellcasting ability modifier. The temporary hit points are lost when the spell ends.\"\n}",
    "wild cunning]": "{\n\tname : \"Wild Cunning\",\n\tclasses : [\"druid\", \"ranger\"],\n\tsource : [\"UA:SS\", 5],\n\tritual : true,\n\tlevel : 1,\n\tschool : \"Trans\",\n\ttime : \"1 a\",\n\trange : \"120 ft\",\n\tcomponents : \"V,S\",\n\tduration : \"Instantaneous\",\n\tdescription : \"Call spirits of nature to aid you with finding food/drink/tracks/shelter, or camping; see book\",\n\tdescriptionFull : \"You call out to the spirits of nature to aid you. When you cast this spell, choose one of the following effects:\" + \"\\n  \\u2022 \" + \"If there are any tracks on the ground within range, you know where they are, and you make Wisdom (Survival) checks to follow these tracks with advantage for 1 hour or until you cast this spell again.\" + \"\\n  \\u2022 \" + \"If there is edible forage within range, you know it and where to find it.\" + \"\\n  \\u2022 \" + \"If there is clean drinking water within range, you know it and where to find it.\" + \"\\n  \\u2022 \" + \"If there is suitable shelter for you and your companions with range, you know it and where to find.\" + \"\\n  \\u2022 \" + \"Send the spirits to bring back wood for a fire and to set up a campsite in the area using your supplies. The spirits build the fire in a circle of stones, put up tents, unroll bedrolls, and put out any rations and water for consumption.\" + \"\\n  \\u2022 \" + \"Have the spirits instantly break down a campsite, which includes putting out a fire, taking down tents, packing up bags, and burying any rubbish.\"\n}",
    "zephyr strike]": "{ // clarification: https://twitter.com/JeremyECrawford/status/849302527069884416\n\tname : \"Zephyr Strike\",\n\tclasses : [\"ranger\"],\n\tsource : [\"UA:SS\", 5],\n\tritual : false,\n\tlevel : 1,\n\tschool : \"Trans\",\n\ttime : \"1 bns\",\n\trange : \"Self\",\n\tcomponents : \"V\",\n\tduration : \"Conc, 1 min\",\n\tdescription : \"Moving doesn't provoke opportunity atks; next wea atk has adv and gives +30 ft speed for that turn\",\n\tdescriptionFull : \"You move like the wind. For the duration, your movement doesn't provoke opportunity attacks.\" + \"\\n   \" + \"In addition, the first time you make a weapon attack on your turn before the spell ends, you make the attack roll with advantage, and your speed increases by 30 feet until the end of that turn.\"\n}",
    "toll the dead]": "{\n\t\tname : \"Toll the Dead\",\n\t\tclasses : [\"cleric\", \"warlock\", \"wizard\"],\n\t\tsource : [[\"X\", 169], [\"UA:SS\", 4]],\n\t\tritual : false,\n\t\tlevel : 0,\n\t\tschool : \"Necro\",\n\t\ttime : \"1 a\",\n\t\trange : \"60 ft\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Instantaneous\",\n\t\tsave : \"Wis\",\n\t\tdescription : \"1 crea save or 1d12 Necrotic damage (only 1d8 if at full hp); +1d12/+1d8 at CL 5, 11, and 17\",\n\t\tdescriptionFull : \"You point at one creature you can see within range, and the sound of a dolorous bell fills the air around it for a moment. The target must succeed on a Wisdom saving throw or take 1d8 necrotic damage. If the target is missing any of its hit points, it instead takes 1d12 necrotic damage.\" + \"\\n   \" + \"The spell's damage increases by one die when you reach 5th level (2d8 or 2d12), 11th level (3d8 or 3d12), and 17th level (4d8 or 4d12).\"\n\t}",
    "gust]) {\n\t\tSpellsList[gust]": "{\n\t\t\tname : \"Gust\",\n\t\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\t\tsource : [[\"WGtE\", 107], [\"X\", 157], [\"E\", 19], [\"UA:D\", 6]],\n\t\t\tlevel : 0,\n\t\t\tschool : \"Trans\",\n\t\t\ttime : \"1 a\",\n\t\t\trange : \"30 ft\",\n\t\t\tcomponents : \"V,S\",\n\t\t\tduration : \"Instantaneous\",\n\t\t\tsave : \"Str\",\n\t\t\tdescription : \"Med. or smaller crea save or push 5 ft; or push unattended 5 lb obj 10 ft; or harmless sensory effect\",\n\t\t\tdescriptionFull : \"You seize the air and compel it to create one of the following effects at a point you can see within range.\" + \"\\n \" + \"\\u2022 One Medium or smaller creature that you choose must succeed on a Strength saving throw or be pushed up to 5 feet away from you.\" + \"\\n \" + \"\\u2022 You create a small blast of air capable of moving one object that is neither held nor carried and that weighs no more than 5 pounds. The object is pushed up to 10 feet away from you. It isn't pushed with enough force to cause damage.\" + \"\\n \" + \"\\u2022 You create a harmless sensory affect using air, such as causing leaves to rustle, wind to slam shutters shut, or your clothing to ripple in a breeze.\"\n\t\t}",
    "control winds]) {\n\tSpellsList[control winds]": "{\n\t\tname : \"Control Winds\",\n\t\tclasses : [\"druid\", \"sorcerer\", \"wizard\"],\n\t\tsource : [[\"X\", 152], [\"E\", 16], [\"UA:D\", 8]],\n\t\tlevel : 5,\n\t\tschool : \"Trans\",\n\t\ttime : \"1 a\",\n\t\trange : \"300 ft\",\n\t\tcomponents : \"V,S\",\n\t\tduration : \"Conc, 1 h\",\n\t\tdescription : \"100-ft cube of air either gusts, downdraft, or updraft; affects flying/jump/ranged; 1 a change; see B\",\n\t\tdescriptionFull : \"You take control of the air in a 100-foot cube that you can see within range. Choose one of the following effects when you cast the spell. The effect lasts for the spell's duration, unless you use your action on a later turn to switch to a different effect. You can also use your action to temporarily halt the effect or to restart one you've halted.\" + \"\\n   \" + toUni(\"Gusts\") + \": A wind picks up within the cube, continually blowing in a horizontal direction you designate. You choose the intensity of the wind: calm, moderate, or strong. If the wind is moderate or strong, ranged weapon attacks that enter or leave the cube or pass through it have disadvantage on their attack rolls. If the wind is strong, any creature moving against the wind must spend 1 extra foot of movement for each foot moved.\" + \"\\n   \" + toUni(\"Downdraft\") + \": You cause a sustained blast of strong wind to blow downward from the top of the cube. Ranged weapon attacks that pass through the cube or that are made against targets within it have disadvantage on their attack rolls. A creature must make a Strength saving throw if it flies into the cube for the first time on a turn or starts its turn there flying. On a failed save, the creature is knocked prone.\" + \"\\n   \" + toUni(\"Updraft\") + \": You cause a sustained updraft within the cube, rising upward from the cube's bottom side. Creatures that end a fall within the cube take only half damage from the fall. When a creature in the cube makes a vertical jump, the creature can jump up to 10 feet higher than normal.\"\n\t}"
}